kyb110811/2026ESWContest_free_SAYFE/nrf5340/ncs/v3.4.0/nrf/samples/bluetooth/nrf_auraconfig/src/nrf_auraconfig.c
/*
 * Copyright (c) 2024 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-Nordic-5-Clause
 */

#include <stdlib.h>
#include <strings.h>
#include <ctype.h>
#include <zephyr/bluetooth/audio/audio.h>
#include <zephyr/kernel.h>
#include <zephyr/zbus/zbus.h>
#include <zephyr/sys/byteorder.h>
#include <zephyr/shell/shell.h>
#include <nrfx_clock.h>
#include <audio_defines.h>

#include "presets.h"
#include "broadcast_source.h"
#include "zbus_common.h"
#include "macros_common.h"
#include "bt_mgmt.h"
#include "lc3_streamer.h"
#include "led_assignments.h"
#include "led.h"
#include "sd_card.h"

//modified code
#include "audio_system.h"

#include "streamctrl.h"
////==========

#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(main, CONFIG_MAIN_LOG_LEVEL);

ZBUS_CHAN_DECLARE(bt_mgmt_chan);
ZBUS_CHAN_DECLARE(sdu_ref_chan);
ZBUS_CHAN_DECLARE(le_audio_chan);
ZBUS_MSG_SUBSCRIBER_DEFINE(le_audio_evt_sub);

/* SD card detection */
static bool sd_card_present = true;

static struct k_thread le_audio_msg_sub_thread_data;
static k_tid_t le_audio_msg_sub_thread_id;
K_THREAD_STACK_DEFINE(le_audio_msg_sub_thread_stack, CONFIG_LE_AUDIO_MSG_SUB_STACK_SIZE);
NET_BUF_POOL_FIXED_DEFINE(ble_tx_pool, CONFIG_BT_ISO_TX_BUF_COUNT, CONFIG_BT_ISO_TX_MTU,
			  sizeof(struct audio_metadata), NULL);

static void lecture_set(const struct shell *shell);
static int big_enable(const struct shell *shell, uint8_t big_index);

struct bt_le_ext_adv *ext_adv;

/* Buffer for the UUIDs. */
#define EXT_ADV_UUID_BUF_SIZE (128)
NET_BUF_SIMPLE_DEFINE_STATIC(uuid_data0, EXT_ADV_UUID_BUF_SIZE);
NET_BUF_SIMPLE_DEFINE_STATIC(uuid_data1, EXT_ADV_UUID_BUF_SIZE);

/* Buffer for periodic advertising BASE data. */
#define BASE_DATA_BUF_SIZE (256)
NET_BUF_SIMPLE_DEFINE_STATIC(base_data0, BASE_DATA_BUF_SIZE);
NET_BUF_SIMPLE_DEFINE_STATIC(base_data1, BASE_DATA_BUF_SIZE);

/* Extended advertising buffer. */
static struct bt_data ext_adv_buf[CONFIG_BT_ISO_MAX_BIG][CONFIG_EXT_ADV_BUF_MAX];

/* Periodic advertising buffer. */
static struct bt_data per_adv_buf[CONFIG_BT_ISO_MAX_BIG];

/* Total size of the PBA buffer includes the 16-bit UUID, 8-bit features and the
 * meta data size.
 */
#define BROADCAST_SRC_PBA_BUF_SIZE                                                                 \
	(BROADCAST_SOURCE_PBA_HEADER_SIZE + CONFIG_BT_AUDIO_BROADCAST_PBA_METADATA_SIZE)

/* Number of metadata items that can be assigned. */
#define BROADCAST_SOURCE_PBA_METADATA_VACANT                                                       \
	(CONFIG_BT_AUDIO_BROADCAST_PBA_METADATA_SIZE / (sizeof(struct bt_data)))

/* Make sure pba_buf is large enough for a 16bit UUID and meta data
 * (any addition to pba_buf requires an increase of this value)
 */
uint8_t pba_data[CONFIG_BT_ISO_MAX_BIG][BROADCAST_SRC_PBA_BUF_SIZE];

/**
 * @brief	Broadcast source static extended advertising data.
 */
static struct broadcast_source_ext_adv_data ext_adv_data[] = {
	{.uuid_buf = &uuid_data0,
	 .pba_metadata_vacant_cnt = BROADCAST_SOURCE_PBA_METADATA_VACANT,
	 .pba_buf = pba_data[0]},
	{.uuid_buf = &uuid_data1,
	 .pba_metadata_vacant_cnt = BROADCAST_SOURCE_PBA_METADATA_VACANT,
	 .pba_buf = pba_data[1]}};

/**
 * @brief	Broadcast source static periodic advertising data.
 */
static struct broadcast_source_per_adv_data per_adv_data[] = {{.base_buf = &base_data0},
							      {.base_buf = &base_data1}};

static struct broadcast_source_big broadcast_param[CONFIG_BT_ISO_MAX_BIG];
static struct subgroup_config subgroups[CONFIG_BT_ISO_MAX_BIG]
				       [CONFIG_BT_BAP_BROADCAST_SRC_SUBGROUP_COUNT];

static enum bt_audio_location stream_location[CONFIG_BT_ISO_MAX_BIG]
					     [CONFIG_BT_BAP_BROADCAST_SRC_SUBGROUP_COUNT]
					     [CONFIG_BT_BAP_BROADCAST_SRC_STREAM_COUNT] = {
						     {{BT_AUDIO_LOCATION_MONO_AUDIO}}};

#define LC3_STREAMER_INDEX_UNUSED 0xFF

struct subgroup_lc3_stream_info {
	size_t frame_size;
	uint8_t lc3_streamer_idx[CONFIG_BT_BAP_BROADCAST_SRC_STREAM_COUNT];
	bool frame_loaded[CONFIG_BT_BAP_BROADCAST_SRC_STREAM_COUNT];
	uint8_t *frame_ptrs[CONFIG_BT_BAP_BROADCAST_SRC_STREAM_COUNT];
};

static struct subgroup_lc3_stream_info lc3_stream_infos[CONFIG_BT_ISO_MAX_BIG]
						       [CONFIG_BT_BAP_BROADCAST_SRC_SUBGROUP_COUNT];

struct bis_work_item {
	struct k_work_delayable work;
	struct stream_index stream_idx;
};

static struct bis_work_item bis_work_items[CONFIG_BT_ISO_MAX_BIG]
					  [CONFIG_BT_BAP_BROADCAST_SRC_SUBGROUP_COUNT]
					  [CONFIG_BT_BAP_BROADCAST_SRC_STREAM_COUNT];

/* Find the most significant 1 in bits, bits will not be 0. */
static int8_t context_msb_one(uint16_t bits)
{
	uint8_t pos = 0;

	while (bits >>= 1) {
		pos++;
	}

	return pos;
}

static struct bt_bap_lc3_preset *preset_find(const char *name)
{
	for (size_t i = 0; i < ARRAY_SIZE(bap_presets); i++) {
		if (strcmp(bap_presets[i].name, name) == 0) {
			return bap_presets[i].preset;
		}
	}

	return NULL;
}

static char *preset_name_find(struct bt_bap_lc3_preset *preset)
{
	for (size_t i = 0; i < ARRAY_SIZE(bap_presets); i++) {
		if (bap_presets[i].preset == preset) {
			return bap_presets[i].name;
		}
	}

	return "Custom";
}

/**
 * @brief	Check if a given string is a hexadecimal value.
 *
 * @param[in]	str	Pointer to the string to check.
 * @param[out]	len	Pointer to the length of the string.
 *
 * @return	True if the string is a hexadecimal value, false otherwise.
 */
static bool is_hex(const char *str, uint8_t *len)
{
	/* Check if the string is empty */
	if (*str == '\0') {
		return false;
	}

	*len = strlen(str);

	/* Skip 0x if present */
	if (*str == '0' && (*(str + 1) == 'x' || *(str + 1) == 'X')) {
		str += 2;
		*len -= 2;
	}

	/* Iterate through each character of the string */
	for (uint8_t i = 0; i < *len; i++) {
		/* Check if the character is not a hexadecimal digit */
		if (!isxdigit((int)*str)) {
			return false;
		}

		str++;
	}

	/* All characters are hexadecimal digits */
	return true;
}

static bool is_number(const char *str)
{
	/* Check if the string is empty */
	if (*str == '\0') {
		return false;
	}

	uint8_t len = strlen(str);

	/* Iterate through each character of the string */
	for (uint8_t i = 0; i < len; i++) {
		/* Check if the character is not a digit */
		if (!isdigit((int)*str)) {
			return false;
		}
		str++;
	}

	/* All characters are digits */
	return true;
}

