kyb110811/2026ESWContest_free_SAYFE/nrf5340/ncs/v3.4.0/nrf/samples/bluetooth/nrf_auraconfig/src/nrf_auraconfig.c
static void subgroup_send(struct stream_index stream_idx, struct net_buf *audio_frame_out)
{
	int ret;
	static int prev_ret;

	uint8_t num_bis = subgroups[stream_idx.lvl1][stream_idx.lvl2].num_bises;
	size_t frame_size = lc3_stream_infos[stream_idx.lvl1][stream_idx.lvl2].frame_size;
	struct net_buf *audio_frame = net_buf_alloc(&ble_tx_pool, K_NO_WAIT);
	struct audio_metadata *meta = net_buf_user_data(audio_frame);

	if (audio_frame == NULL) {
		LOG_ERR("Out of RX buffers");
		return;
	}
	
	for (int i = 0; i < num_bis; i++) {
		uint8_t *frame_ptr =
			lc3_stream_infos[stream_idx.lvl1][stream_idx.lvl2].frame_ptrs[i];

		// net_buf_add_mem(audio_frame, frame_ptr, frame_size);
		
		meta->locations |=
			(uint32_t)subgroups[stream_idx.lvl1][stream_idx.lvl2].location[i];
		
	}

	// modified code
	net_buf_add_mem(audio_frame,
                audio_frame_out->data,
                audio_frame_out->len);

	meta->data_coding = LC3;

	struct bt_audio_codec_cfg *codec_cfg =
		&subgroups[stream_idx.lvl1][stream_idx.lvl2].group_lc3_preset.codec_cfg;

	ret = le_audio_freq_hz_get(codec_cfg, &meta->sample_rate_hz);
	if (ret) {
		LOG_ERR("Failed to get frequency: %d", ret);
	}

	ret = le_audio_duration_us_get(codec_cfg, &meta->data_len_us);
	if (ret) {
		LOG_ERR("Failed to get frame duration: %d", ret);
	}

	ret = broadcast_source_send(audio_frame, stream_idx.lvl1, stream_idx.lvl2);

	if (ret != 0 && ret != prev_ret) {
		if (ret == -ECANCELED) {
			LOG_WRN("Sending cancelled");
		} else {
			LOG_WRN("broadcast_source_send returned: %d", ret);
		}
	}

	net_buf_unref(audio_frame);

	prev_ret = ret;
	

}

static void stream_frame_dummy_get_and_send(struct stream_index stream_idx)
{
	struct subgroup_lc3_stream_info *bis_info =
		&(lc3_stream_infos[stream_idx.lvl1][stream_idx.lvl2]);

	static uint8_t frame_value;

	uint8_t num_bis = subgroups[stream_idx.lvl1][stream_idx.lvl2].num_bises;
	bis_info->frame_size = subgroups[stream_idx.lvl1][stream_idx.lvl2].group_lc3_preset.qos.sdu;

	uint8_t frame_buffer[bis_info->frame_size];

	memset(frame_buffer, frame_value, bis_info->frame_size);

	bis_info->frame_ptrs[stream_idx.lvl3] = frame_buffer;
	bis_info->frame_loaded[stream_idx.lvl3] = true;

	int loaded_count = 0;

	for (int i = 0; i < num_bis; i++) {
		if (bis_info->frame_loaded[i]) {
			++loaded_count;
		}
	}

	if (loaded_count == num_bis) {
		frame_value++;
		// subgroup_send(stream_idx);

		for (int i = 0; i < num_bis; i++) {
			bis_info->frame_loaded[i] = false;
			bis_info->frame_ptrs[i] = NULL;
		}
	}
}

static void stream_frame_get_and_send(struct stream_index stream_idx)
{
	int ret;

	struct subgroup_lc3_stream_info *bis_info =
		&(lc3_stream_infos[stream_idx.lvl1][stream_idx.lvl2]);

	uint8_t num_bis = subgroups[stream_idx.lvl1][stream_idx.lvl2].num_bises;
	uint8_t stream_file_idx = bis_info->lc3_streamer_idx[stream_idx.lvl3];

	if (stream_file_idx == LC3_STREAMER_INDEX_UNUSED) {
		LOG_ERR("Stream index for stream big %d sub: %d bis: %d is unused", stream_idx.lvl1,
			stream_idx.lvl2, stream_idx.lvl3);
		return;
	}

	ret = lc3_streamer_next_frame_get(
		stream_file_idx, (const uint8_t **const)&(bis_info->frame_ptrs[stream_idx.lvl3]));
	if (ret == -ENODATA) {
		LOG_WRN("No more frames to read");
		ret = lc3_streamer_stream_close(stream_file_idx);
		if (ret) {
			LOG_ERR("Failed to close stream: %d", ret);
		}

		bis_info->lc3_streamer_idx[stream_idx.lvl3] = LC3_STREAMER_INDEX_UNUSED;

		return;
	} else if (ret == -ENOMSG) {
		LOG_DBG("Frame from SD card not ready for stream %d, using zero packet",
			stream_idx.lvl3);
		bis_info->frame_ptrs[stream_idx.lvl3] = NULL;
	} else if (ret) {
		LOG_ERR("Failed to get next frame: %d", ret);
		return;
	}

	bis_info->frame_loaded[stream_idx.lvl3] = true;

	int loaded_count = 0;

	for (int i = 0; i < num_bis; i++) {
		if (bis_info->frame_loaded[i]) {
			++loaded_count;
		}
	}

	if (loaded_count == num_bis) {
		// subgroup_send(stream_idx);

		for (int i = 0; i < num_bis; i++) {
			bis_info->frame_loaded[i] = false;
			bis_info->frame_ptrs[i] = NULL;
		}
	}
}

static void pending_k_work_flush(void)
{
	int ret;

	for (int i = 0; i < CONFIG_BT_ISO_MAX_BIG; i++) {
		for (int j = 0; j < CONFIG_BT_BAP_BROADCAST_SRC_SUBGROUP_COUNT; j++) {
			for (int k = 0; k < CONFIG_BT_BAP_BROADCAST_SRC_STREAM_COUNT; k++) {
				ret = k_work_cancel_delayable(&bis_work_items[i][j][k].work);
				if (ret != 0 && ret != -EINVAL) {
					LOG_ERR("Failed to cancel BIS work: %d", ret);
				}
			}
		}
	}
}


// modified code
void stream_frame_send(struct net_buf *audio_kor, struct net_buf *audio_eng)
{
	struct stream_index kor_idx = {
        .lvl1 = 0,
        .lvl2 = 0,
        .lvl3 = 0
    };
	subgroup_send(kor_idx, audio_kor);
	
	struct stream_index eng_idx = {
        .lvl1 = 1,
        .lvl2 = 0,
        .lvl3 = 0
    };
	subgroup_send(eng_idx, audio_eng);
	
}


/**
 * @brief	Handle Bluetooth LE audio events.
 */
static void le_audio_msg_sub_thread(void)
{
	int ret;
	const struct zbus_channel *chan;

	// modified code ===========================
	bool state_stream = false;
	// =========================================

	LOG_DBG("Zbus subscription thread started");

	while (1) {
		struct le_audio_msg msg;

		ret = zbus_sub_wait_msg(&le_audio_evt_sub, &chan, &msg, K_FOREVER);
		ERR_CHK(ret);

		switch (msg.event) {

		case LE_AUDIO_EVT_STREAM_SENT:
			LOG_DBG("LE_AUDIO_EVT_STREAM_SENT for stream BIG %d sub: %d BIS: %d",
				msg.idx.lvl1, msg.idx.lvl2, msg.idx.lvl3);
			break;

		case LE_AUDIO_EVT_STREAMING:
			LOG_DBG("LE audio evt streaming for stream BIG %d sub: %d BIS: %d",
				msg.idx.lvl1, msg.idx.lvl2, msg.idx.lvl3);

			// modified code ===========================
			audio_system_encoder_start();
			
			if (state_stream == true) {
				LOG_DBG("Got streaming event in streaming state");
				break;
			}

			audio_system_start();
			state_stream = true;
			//==========================================
 
			/*
			if (sd_card_present) {
				stream_frame_get_and_send(msg.idx);
			} else {
				stream_frame_dummy_get_and_send(msg.idx);
			}
			*/

			break;

