kyb110811/2026ESWContest_free_SAYFE/nrf5340/ncs/v3.4.0/nrf/samples/bluetooth/nrf_auraconfig/src/nrf_auraconfig.c
		case LE_AUDIO_EVT_NOT_STREAMING:
			LOG_DBG("LE audio evt not_streaming");

			// modified code ===========================
			audio_system_encoder_stop();
			state_stream = false;
			audio_system_stop();
			// =========================================

			/* Remove any pending BIS work items */
			pending_k_work_flush();

			break;

		default:
			LOG_WRN("Unexpected/unhandled le_audio event: %d", msg.event);

			break;
		}

		STACK_USAGE_PRINT("le_audio_msg_thread", &le_audio_msg_sub_thread_data);
	}
}

static void bis_work_items_fn(struct k_work *work)
{
	struct k_work_delayable *dwork = k_work_delayable_from_work(work);
	struct bis_work_item *bis_item = CONTAINER_OF(dwork, struct bis_work_item, work);

	if (sd_card_present) {
		stream_frame_get_and_send(bis_item->stream_idx);
	} else {
		stream_frame_dummy_get_and_send(bis_item->stream_idx);
	}
}

static void stream_queue_sdu_ref_update(const struct zbus_channel *chan)
{
	int ret;
	uint32_t tx_sync_ts_us;
	uint32_t curr_ts_us;
	uint32_t time_to_next_send_us;
	const struct sdu_ref_msg *msg;

	msg = zbus_chan_const_msg(chan);
	tx_sync_ts_us = msg->tx_sync_ts_us;
	curr_ts_us = msg->curr_ts_us;

	/* There will only be one codec configuration per subgroup */
	struct bt_audio_codec_cfg *codec_cfg = &broadcast_param[msg->idx[0].lvl1]
							.subgroups[msg->idx[0].lvl2]
							.group_lc3_preset.codec_cfg;

	struct lc3_stream_cfg cfg;

	ret = le_audio_duration_us_get(codec_cfg, &cfg.frame_duration_us);
	if (ret) {
		LOG_ERR("Failed to get frame duration: %d", ret);
	}

	if (!msg->tx_sync_ts_us_valid || tx_sync_ts_us < curr_ts_us) {
		LOG_WRN("TX sync timestamp is invalid");
		time_to_next_send_us = cfg.frame_duration_us;
	} else {
		time_to_next_send_us = tx_sync_ts_us - (curr_ts_us);
	}

	for (uint8_t i = 0; i < msg->num_idx; i++) {
		LOG_DBG("Scheduling send for stream BIG %d sub: %d BIS: %d", msg->idx[i].lvl1,
			msg->idx[i].lvl2, msg->idx[i].lvl3);

		ret = k_work_schedule(
			&bis_work_items[msg->idx[i].lvl1][msg->idx[i].lvl2][msg->idx[i].lvl3].work,
			K_USEC(time_to_next_send_us));

		if (ret < 0) {
			LOG_ERR("Failed to schedule BIS work: %d", ret);
		}
	}
}

ZBUS_LISTENER_DEFINE(sdu_ref_msg_listen, stream_queue_sdu_ref_update);

/**
 * @brief	Create zbus subscriber threads.
 *
 * @return	0 for success, error otherwise.
 */
static int zbus_subscribers_create(void)
{
	int ret;

	le_audio_msg_sub_thread_id = k_thread_create(
		&le_audio_msg_sub_thread_data, le_audio_msg_sub_thread_stack,
		CONFIG_LE_AUDIO_MSG_SUB_STACK_SIZE, (k_thread_entry_t)le_audio_msg_sub_thread, NULL,
		NULL, NULL, K_PRIO_PREEMPT(CONFIG_LE_AUDIO_MSG_SUB_THREAD_PRIO), 0, K_NO_WAIT);
	ret = k_thread_name_set(le_audio_msg_sub_thread_id, "LE_AUDIO_MSG_SUB");
	if (ret) {
		LOG_ERR("Failed to create le_audio_msg thread");
		return ret;
	}

	return 0;
}

/**
 * @brief	Zbus listener to receive events from bt_mgmt.
 *
 * @param[in]	chan	Zbus channel.
 *
 * @note	Will in most cases be called from BT_RX context,
 *		so there should not be too much processing done here.
 */
static void bt_mgmt_evt_handler(const struct zbus_channel *chan)
{
	int ret;
	const struct bt_mgmt_msg *msg;

	msg = zbus_chan_const_msg(chan);

	switch (msg->event) {
	case BT_MGMT_EXT_ADV_WITH_PA_READY:
		ext_adv = msg->ext_adv;

		ret = broadcast_source_start(msg->index, ext_adv);
		if (ret) {
			LOG_ERR("Failed to start broadcaster: %d", ret);
		}

		break;

	default:
		LOG_WRN("Unexpected/unhandled bt_mgmt event: %d", msg->event);
		break;
	}
}

ZBUS_LISTENER_DEFINE(bt_mgmt_evt_listen, bt_mgmt_evt_handler);

/**
 * @brief	Link zbus producers and observers.
 *
 * @return	0 for success, error otherwise.
 */
static int zbus_link_producers_observers(void)
{
	int ret;

	if (!IS_ENABLED(CONFIG_ZBUS)) {
		return -ENOTSUP;
	}

	ret = zbus_chan_add_obs(&bt_mgmt_chan, &bt_mgmt_evt_listen,
				ZBUS_ADD_OBS_TIMEOUT_MS);
	if (ret) {
		LOG_ERR("Failed to add bt_mgmt listener");
		return ret;
	}

	ret = zbus_chan_add_obs(&le_audio_chan, &le_audio_evt_sub,
				ZBUS_ADD_OBS_TIMEOUT_MS);
	if (ret) {
		LOG_ERR("Failed to add le_audio sub");
		return ret;
	}

	ret = zbus_chan_add_obs(&sdu_ref_chan, &sdu_ref_msg_listen, ZBUS_ADD_OBS_TIMEOUT_MS);
	if (ret) {
		LOG_ERR("Failed to add sdu_ref listener");
		return ret;
	}

	return 0;
}

/*
 * @brief  The following configures the data for the extended advertising.
 *         This includes the Broadcast Audio Announcements [BAP 3.7.2.1] and Broadcast_ID
 *         [BAP 3.7.2.1.1] in the AUX_ADV_IND Extended Announcements.
 *
 * @param  big_index         Index of the Broadcast Isochronous Group (BIG) to get
 *                           advertising data for.
 * @param  ext_adv_data      Pointer to the extended advertising buffers.
 * @param  ext_adv_buf       Pointer to the bt_data used for extended advertising.
 * @param  ext_adv_buf_size  Size of @p ext_adv_buf.
 * @param  ext_adv_count     Pointer to the number of elements added to @p adv_buf.
 *
 * @return  0 for success, error otherwise.
 */
static int ext_adv_populate(uint8_t big_index, struct broadcast_source_ext_adv_data *ext_adv_data,
			    struct bt_data *ext_adv_buf, size_t ext_adv_buf_size,
			    size_t *ext_adv_count)
{
	int ret;
	size_t ext_adv_buf_cnt = 0;

	ext_adv_buf[ext_adv_buf_cnt].type = BT_DATA_UUID16_ALL;
	ext_adv_buf[ext_adv_buf_cnt].data = ext_adv_data->uuid_buf->data;
	ext_adv_buf_cnt++;

	ext_adv_buf[ext_adv_buf_cnt].type = BT_DATA_NAME_COMPLETE;
	if (strnlen(broadcast_param[big_index].adv_name,
		    ARRAY_SIZE(broadcast_param[big_index].adv_name)) > 0) {
		/* Use custom advertising name */
		ext_adv_buf[ext_adv_buf_cnt].data = broadcast_param[big_index].adv_name;
		ext_adv_buf[ext_adv_buf_cnt].data_len = strlen(broadcast_param[big_index].adv_name);
	} else {
		/* Use default device name */
		ext_adv_buf[ext_adv_buf_cnt].data = CONFIG_BT_DEVICE_NAME;
		ext_adv_buf[ext_adv_buf_cnt].data_len = strlen(CONFIG_BT_DEVICE_NAME);
	}
	ext_adv_buf_cnt++;

	ret = bt_mgmt_manufacturer_uuid_populate(ext_adv_data->uuid_buf,
						 CONFIG_BT_DEVICE_MANUFACTURER_ID);
	if (ret) {
		LOG_ERR("Failed to add adv data with manufacturer ID: %d", ret);
		return ret;
	}

	ret = broadcast_source_ext_adv_populate(big_index, broadcast_param[big_index].fixed_id,
						broadcast_param[big_index].broadcast_id,
						ext_adv_data, &ext_adv_buf[ext_adv_buf_cnt],
						ext_adv_buf_size - ext_adv_buf_cnt);
	if (ret < 0) {
		LOG_ERR("Failed to add ext adv data for broadcast source: %d", ret);
		return ret;
	}

	ext_adv_buf_cnt += ret;

	/* Add the number of UUIDs */
	ext_adv_buf[0].data_len = ext_adv_data->uuid_buf->len;

	LOG_DBG("Size of adv data: %d, num_elements: %d", sizeof(struct bt_data) * ext_adv_buf_cnt,
		ext_adv_buf_cnt);

