kyb110811/2026ESWContest_free_SAYFE/nrf5340/ncs/v3.4.0/nrf/samples/bluetooth/nrf_auraconfig/src/nrf_auraconfig.c
	*ext_adv_count = ext_adv_buf_cnt;

	return 0;
}

/*
 * @brief  The following configures the data for the periodic advertising.
 *         This includes the Basic Audio Announcement, including the
 *         BASE [BAP 3.7.2.2] and BIGInfo.
 *
 * @param  big_index         Index of the Broadcast Isochronous Group (BIG) to get
 *                           advertising data for.
 * @param  pre_adv_data      Pointer to the periodic advertising buffers.
 * @param  per_adv_buf       Pointer to the bt_data used for periodic advertising.
 * @param  per_adv_buf_size  Size of @p ext_adv_buf.
 * @param  per_adv_count     Pointer to the number of elements added to @p adv_buf.
 *
 * @return  0 for success, error otherwise.
 */
static int per_adv_populate(uint8_t big_index, struct broadcast_source_per_adv_data *pre_adv_data,
			    struct bt_data *per_adv_buf, size_t per_adv_buf_size,
			    size_t *per_adv_count)
{
	int ret;
	size_t per_adv_buf_cnt = 0;

	ret = broadcast_source_per_adv_populate(big_index, pre_adv_data, per_adv_buf,
						per_adv_buf_size - per_adv_buf_cnt);
	if (ret < 0) {
		LOG_ERR("Failed to add per adv data for broadcast source: %d", ret);
		return ret;
	}

	per_adv_buf_cnt += ret;

	LOG_DBG("Size of per adv data: %d, num_elements: %d",
		sizeof(struct bt_data) * per_adv_buf_cnt, per_adv_buf_cnt);

	*per_adv_count = per_adv_buf_cnt;

	return 0;
}

static void broadcast_create(uint8_t big_index)
{
	if (big_index >= CONFIG_BT_ISO_MAX_BIG) {
		LOG_ERR("BIG index out of range");
		return;
	}

	struct broadcast_source_big *brdcst_param = &broadcast_param[big_index];

	for (size_t i = 0; i < ARRAY_SIZE(subgroups[big_index]); i++) {
		if (subgroups[big_index][i].num_bises == 0) {
			/* Default to 2 BISes */
			subgroups[big_index][i].num_bises = 2;
		}

		if (subgroups[big_index][i].context == 0) {
			subgroups[big_index][i].context = BT_AUDIO_CONTEXT_TYPE_MEDIA;
		}

		subgroups[big_index][i].location = stream_location[big_index][i];
	}

	brdcst_param->subgroups = subgroups[big_index];

	if (brdcst_param->broadcast_name[0] == '\0') {
		/* Name not set, using default */
		if (sizeof(CONFIG_BT_AUDIO_BROADCAST_NAME) > sizeof(brdcst_param->broadcast_name)) {
			LOG_ERR("Broadcast name too long");
			return;
		}

		size_t brdcst_name_size = sizeof(CONFIG_BT_AUDIO_BROADCAST_NAME) - 1;

		memcpy(brdcst_param->broadcast_name, CONFIG_BT_AUDIO_BROADCAST_NAME,
		       brdcst_name_size);
	}

	/* If no subgroups are defined, set to 1 */
	if (brdcst_param->num_subgroups == 0) {
		brdcst_param->num_subgroups = 1;
	}
}

/**
 * @brief	Clear all broadcast configurations.
 */
static void nrf_auraconfig_clear(void)
{
	int ret;

	if (sd_card_present) {
		ret = lc3_streamer_close_all_streams();
		if (ret) {
			LOG_ERR("Failed to close all LC3 streams: %d", ret);
		}
	}

	for (size_t i = 0; i < ARRAY_SIZE(broadcast_param); i++) {
		memset(&broadcast_param[i], 0, sizeof(broadcast_param[i]));
		for (size_t j = 0; j < ARRAY_SIZE(subgroups[i]); j++) {
			memset(&subgroups[i][j], 0, sizeof(subgroups[i][j]));
			for (size_t k = 0; k < ARRAY_SIZE(stream_location[i][j]); k++) {
				stream_location[i][j][k] = BT_AUDIO_LOCATION_MONO_AUDIO;
				lc3_stream_infos[i][j].lc3_streamer_idx[k] =
					LC3_STREAMER_INDEX_UNUSED;
			}
		}
	}
}

#define SD_FILECOUNT_MAX 420
#define SD_PATHLEN_MAX	 190
static char sd_paths_and_files[SD_FILECOUNT_MAX][SD_PATHLEN_MAX];
static uint32_t num_files_added;

static int sd_card_toc_gen(void)
{

	/* Traverse SD tree */
	int ret;

	ret = sd_card_list_files_match(SD_FILECOUNT_MAX, SD_PATHLEN_MAX, sd_paths_and_files, NULL,
				       ".lc3");
	if (ret < 0) {
		return ret;
	}

	num_files_added = ret;

	LOG_INF("Number of *.lc3 files on SD card: %d", num_files_added);

	return 0;
}

void nrf_auraconfig_main(void)
{
	int ret;

	LOG_DBG("Main started");

	ret = nrfx_clock_divider_set(NRF_CLOCK_DOMAIN_HFCLK, NRF_CLOCK_HFCLK_DIV_1);
	ERR_CHK_MSG(ret, "Failed to set HFCLK divider");

	ret = led_init();
	ERR_CHK_MSG(ret, "Failed to initialize LED module");

	ret = led_on(LED_AUDIO_APP_STATUS, LED_COLOR_GREEN);
	ERR_CHK(ret);

	ret = bt_mgmt_init();
	ERR_CHK(ret);
	
	// modified code =============================================
	ret = audio_system_init();
	ERR_CHK(ret);

	ret = audio_system_encoder_num_ch_set(BT_AUDIO_LOCATION_FRONT_LEFT |
					      BT_AUDIO_LOCATION_FRONT_RIGHT);
	ERR_CHK(ret);

	// ==========================================================
	
	ret = zbus_link_producers_observers();
	ERR_CHK_MSG(ret, "Failed to link zbus producers and observers");

	ret = lc3_streamer_init();
	if (ret) {
		LOG_WRN("Failed to initialize LC3 streamer. Transmitting fixed buffers");
		sd_card_present = false;
	}

	for (int i = 0; i < CONFIG_BT_ISO_MAX_BIG; i++) {
		for (int j = 0; j < CONFIG_BT_BAP_BROADCAST_SRC_SUBGROUP_COUNT; j++) {
			for (int k = 0; k < CONFIG_BT_BAP_BROADCAST_SRC_STREAM_COUNT; k++) {
				lc3_stream_infos[i][j].lc3_streamer_idx[k] =
					LC3_STREAMER_INDEX_UNUSED;
				bis_work_items[i][j][k].stream_idx.lvl1 = i;
				bis_work_items[i][j][k].stream_idx.lvl2 = j;
				bis_work_items[i][j][k].stream_idx.lvl3 = k;
				k_work_init_delayable(&bis_work_items[i][j][k].work,
						      bis_work_items_fn);
			}
		}
	}

	ret = zbus_subscribers_create();
	ERR_CHK_MSG(ret, "Failed to create zbus subscriber threads");

	if (sd_card_present) {
		ret = sd_card_toc_gen();
		ERR_CHK_MSG(ret, "Failed to generate SD card table");
	}

	// modified code
	ret = audio_system_config_set(
	bt_audio_codec_cfg_freq_to_freq_hz(CONFIG_BT_AUDIO_PREF_SINK_SAMPLE_RATE_VALUE),
		CONFIG_BT_AUDIO_BITRATE_BROADCAST_SRC, VALUE_NOT_SET);
	ERR_CHK_MSG(ret, "Failed to set sample- and bitrate");
}

static void context_print(const struct shell *shell)
{
	shell_print(shell, "%s", bt_audio_context_bit_to_str(0));

	for (int i = 0; i <= context_msb_one(BT_AUDIO_CONTEXT_TYPE_ANY); i++) {
		shell_print(shell, "%s", bt_audio_context_bit_to_str(BIT(i)));
	}
}

static void codec_qos_print(const struct shell *shell, struct bt_bap_qos_cfg *qos)
{
	if (qos->phy == BT_BAP_QOS_CFG_1M || qos->phy == BT_BAP_QOS_CFG_2M) {
		shell_print(shell, "\t\t\tPHY: %dM", qos->phy);
	} else if (qos->phy == BT_BAP_QOS_CFG_CODED) {
		shell_print(shell, "\t\t\tPHY: LE Coded");
	} else {
		shell_print(shell, "\t\t\tPHY: Unknown");
	}

	shell_print(shell, "\t\t\tFraming: %s",
		    (qos->framing == BT_BAP_QOS_CFG_FRAMING_UNFRAMED ? "unframed" : "framed"));
	shell_print(shell, "\t\t\tRTN: %d", qos->rtn);
	shell_print(shell, "\t\t\tSDU size: %d", qos->sdu);
	shell_print(shell, "\t\t\tMax Transport Latency: %d ms", qos->latency);
	shell_print(shell, "\t\t\tFrame Interval: %d us", qos->interval);
	shell_print(shell, "\t\t\tPresentation Delay: %d us", qos->pd);
}

static void nrf_auraconfig_print(const struct shell *shell, uint8_t group_index)
{
	int ret;

	struct broadcast_source_big *brdcst_param = &broadcast_param[group_index];

	shell_print(shell, "\tAdvertising name: %s",
		    strlen(brdcst_param->adv_name) > 0 ? brdcst_param->adv_name
						       : CONFIG_BT_DEVICE_NAME);

	shell_print(shell, "\tBroadcast name: %s", brdcst_param->broadcast_name);

	if (brdcst_param->fixed_id) {
		shell_print(shell, "\tBroadcast ID (fixed): 0x%04x", brdcst_param->broadcast_id);
	} else if (!broadcast_source_is_streaming(group_index)) {
		shell_print(shell, "\tBroadcast ID (random): Will be set on start");
	} else {
		uint32_t broadcast_id;

		broadcast_source_id_get(group_index, &broadcast_id);
		shell_print(shell, "\tBroadcast ID (random): 0x%04x", broadcast_id);
	}

	shell_print(shell, "\tPacking: %s",
		    (brdcst_param->packing == BT_ISO_PACKING_INTERLEAVED ? "interleaved"
									 : "sequential"));
	shell_print(shell, "\tEncryption: %s",
		    (brdcst_param->encryption == true ? "true" : "false"));

