kyb110811/2026ESWContest_free_SAYFE/nrf5340/ncs/v3.4.0/nrf/samples/bluetooth/nrf_auraconfig/src/nrf_auraconfig.c
	shell_print(shell, "\tBroadcast code: %s", brdcst_param->broadcast_code);

	for (size_t i = 0; i < brdcst_param->num_subgroups; i++) {
		struct bt_audio_codec_cfg *codec_cfg =
			&brdcst_param->subgroups[i].group_lc3_preset.codec_cfg;

		shell_print(shell, "\tSubgroup %d:", i);

		shell_print(shell, "\t\tPreset: %s", brdcst_param->subgroups[i].preset_name);

		codec_qos_print(shell, &brdcst_param->subgroups[i].group_lc3_preset.qos);

		int freq_hz = 0;

		ret = le_audio_freq_hz_get(codec_cfg, &freq_hz);
		if (ret) {
			shell_error(shell, "Failed to get sampling rate: %d", ret);
		} else {
			shell_print(shell, "\t\tSampling rate: %d Hz", freq_hz);
		}

		uint32_t bitrate = 0;

		ret = le_audio_bitrate_get(codec_cfg, &bitrate);
		if (ret) {
			shell_error(shell, "Failed to get bit rate: %d", ret);
		} else {
			shell_print(shell, "\t\tBit rate: %d bps", bitrate);
		}

		int frame_duration = 0;

		ret = le_audio_duration_us_get(codec_cfg, &frame_duration);
		if (ret) {
			shell_error(shell, "Failed to get frame duration: %d", ret);
		} else {
			shell_print(shell, "\t\tFrame duration: %d us", frame_duration);
		}

		uint32_t octets_per_sdu = 0;

		ret = le_audio_octets_per_frame_get(codec_cfg, &octets_per_sdu);
		if (ret) {
			shell_error(shell, "Failed to get octets per frame: %d", ret);
		} else {
			shell_print(shell, "\t\tOctets per frame: %d", octets_per_sdu);
		}

		const uint8_t *language;

		ret = bt_audio_codec_cfg_meta_get_lang(codec_cfg, &language);

		if (ret) {
			shell_print(shell, "\t\tLanguage: not_set");
		} else {
			char lang[LANGUAGE_LEN + 1] = {'\0'};

			memcpy(lang, language, LANGUAGE_LEN);

			shell_print(shell, "\t\tLanguage: %s", lang);
		}

		shell_print(shell, "\t\tContext(s):");

		/* Context container is a bit field */
		for (size_t j = 0U; j <= context_msb_one(BT_AUDIO_CONTEXT_TYPE_ANY); j++) {
			const uint16_t bit_val = BIT(j);

			if (brdcst_param->subgroups[i].context & bit_val) {
				shell_print(shell, "\t\t\t%s",
					    bt_audio_context_bit_to_str(bit_val));
			}
		}

		const unsigned char *program_info;

		ret = bt_audio_codec_cfg_meta_get_program_info(codec_cfg, &program_info);
		if (ret > 0) {
			shell_print(shell, "\t\tProgram info: %s", program_info);
		}

		int immediate =
			bt_audio_codec_cfg_meta_get_bcast_audio_immediate_rend_flag(codec_cfg);

		shell_print(shell, "\t\tImmediate rendering flag: %s",
			    (immediate == 0 ? "set" : "not set"));
		shell_print(shell, "\t\tNumber of BIS: %d", brdcst_param->subgroups[i].num_bises);
		shell_print(shell, "\t\tLocation:");

		for (size_t j = 0; j < brdcst_param->subgroups[i].num_bises; j++) {
			shell_print(shell, "\t\t\tBIS %d: %s", j,
				    bt_audio_location_bit_to_str(
					    brdcst_param->subgroups[i].location[j]));
		}

		shell_print(shell, "\t\tFiles:");

		for (size_t j = 0; j < brdcst_param->subgroups[i].num_bises; j++) {
			uint8_t streamer_idx = lc3_stream_infos[group_index][i].lc3_streamer_idx[j];

			if (!sd_card_present) {
				shell_print(shell, "\t\t\tBIS %d: Fixed data", j);
			} else if (streamer_idx == LC3_STREAMER_INDEX_UNUSED) {
				shell_print(shell, "\t\t\tBIS %d: Not set", j);
			} else {
				char file_name[CONFIG_FS_FATFS_MAX_LFN];
				bool looping = lc3_streamer_is_looping(streamer_idx);

				lc3_streamer_file_path_get(streamer_idx, file_name,
							   sizeof(file_name));
				shell_print(shell, "\t\t\tBIS %d: %s %s", j, file_name,
					    looping ? "(looping)" : "");
			}
		}
	}
}

static int cmd_list(const struct shell *shell, size_t argc, char **argv)
{
	ARG_UNUSED(argc);
	ARG_UNUSED(argv);

	for (size_t i = 0; i < ARRAY_SIZE(bap_presets); i++) {
		shell_print(shell, "%s", bap_presets[i].name);
	}

	return 0;
}

static int adv_create_and_start(const struct shell *shell, uint8_t big_index)
{
	int ret;

	size_t ext_adv_buf_cnt = 0;
	size_t per_adv_buf_cnt = 0;

	if (big_index >= CONFIG_BT_ISO_MAX_BIG) {
		shell_error(shell, "BIG index out of range");
		return -EINVAL;
	}

	if (broadcast_param[big_index].broadcast_name[0] == '\0') {
		/* Name not set, using default */
		size_t brdcst_name_size = sizeof(CONFIG_BT_AUDIO_BROADCAST_NAME) - 1;

		if (brdcst_name_size >= ARRAY_SIZE(ext_adv_data[big_index].brdcst_name_buf)) {
			shell_error(shell, "Broadcast name too long, using parts of the name");
			brdcst_name_size = ARRAY_SIZE(ext_adv_data[big_index].brdcst_name_buf) - 1;
		}

		memcpy(ext_adv_data[big_index].brdcst_name_buf, CONFIG_BT_AUDIO_BROADCAST_NAME,
		       brdcst_name_size);
	} else {
		size_t brdcst_name_size = strlen(broadcast_param[big_index].broadcast_name);

		if (brdcst_name_size >= ARRAY_SIZE(ext_adv_data[big_index].brdcst_name_buf)) {
			shell_error(shell, "Broadcast name too long, using parts of the name");
			brdcst_name_size = ARRAY_SIZE(ext_adv_data[big_index].brdcst_name_buf) - 1;
		}

		memcpy(ext_adv_data[big_index].brdcst_name_buf,
		       broadcast_param[big_index].broadcast_name, brdcst_name_size);
	}

	if (broadcast_param[big_index].adv_name[0] == '\0') {
		/* Name not set, using default */
		size_t adv_name_size = sizeof(CONFIG_BT_AUDIO_BROADCAST_NAME) - 1;

		memcpy(broadcast_param[big_index].adv_name, CONFIG_BT_AUDIO_BROADCAST_NAME,
		       adv_name_size);
	}

	bt_set_name(broadcast_param[big_index].adv_name);

	/* Get advertising set for BIG0 */
	ret = ext_adv_populate(big_index, &ext_adv_data[big_index], ext_adv_buf[big_index],
			       ARRAY_SIZE(ext_adv_buf[big_index]), &ext_adv_buf_cnt);
	if (ret) {
		return ret;
	}

	ret = per_adv_populate(big_index, &per_adv_data[big_index], &per_adv_buf[big_index], 1,
			       &per_adv_buf_cnt);
	if (ret) {
		return ret;
	}

	/* Start broadcaster */
	ret = bt_mgmt_adv_start(big_index, ext_adv_buf[big_index], ext_adv_buf_cnt,
				&per_adv_buf[big_index], per_adv_buf_cnt, false);
	if (ret) {
		shell_error(shell, "Failed to start advertising for BIG%d", big_index);
		return ret;
	}

	return 0;
}

/**
 * @brief	Converts the arguments to BIG and subgroup indexes.
 *
 * @param[in]	shell		Pointer to the shell instance.
 * @param[in]	argc		Number of arguments.
 * @param[in]	argv		Pointer to the arguments.
 * @param[out]	big_index	Pointer to the BIG index.
 * @param[in]	argv_big	Index of the BIG index in the arguments.
 * @param[out]	subgroup_index	Pointer to the subgroup index.
 * @param[in]	argv_subgroup	Index of the subgroup index in the arguments.
 *
 * @return	0 for success, error otherwise.
 */
static int argv_to_indexes(const struct shell *shell, size_t argc, char **argv, uint8_t *big_index,
			   uint8_t argv_big, uint8_t *subgroup_index, uint8_t argv_subgroup)
{

	if (big_index == NULL) {
		shell_error(shell, "BIG index not provided");
		return -EINVAL;
	}

	if (argv_big >= argc) {
		shell_error(shell, "BIG index not provided");
		return -EINVAL;
	}

	if (!is_number(argv[argv_big])) {
		shell_error(shell, "BIG index must be a digit");
		return -EINVAL;
	}

