kyb110811/2026ESWContest_free_SAYFE/nrf5340/ncs/v3.4.0/nrf/samples/bluetooth/nrf_auraconfig/src/nrf_auraconfig.c
	*big_index = (uint8_t)atoi(argv[argv_big]);

	if (*big_index >= CONFIG_BT_ISO_MAX_BIG) {
		shell_error(shell, "BIG index out of range");
		return -EINVAL;
	}

	if (subgroup_index != NULL) {
		if (argv_subgroup >= argc) {
			shell_error(shell, "Subgroup index not provided");
			return -EINVAL;
		}

		if (!is_number(argv[argv_subgroup])) {
			shell_error(shell, "Subgroup index must be a digit");
			return -EINVAL;
		}

		*subgroup_index = (uint8_t)atoi(argv[argv_subgroup]);

		if (*subgroup_index >= CONFIG_BT_BAP_BROADCAST_SRC_SUBGROUP_COUNT) {
			shell_error(shell, "Subgroup index exceeds max value: %d",
				    CONFIG_BT_BAP_BROADCAST_SRC_SUBGROUP_COUNT - 1);
			return -EINVAL;
		}

		if (broadcast_param[*big_index].subgroups == NULL) {
			shell_error(shell, "No subgroups defined for BIG%d", *big_index);
			return -EINVAL;
		}

		if (*subgroup_index >= broadcast_param[*big_index].num_subgroups) {
			shell_error(shell, "Subgroup index out of range");
			return -EINVAL;
		}
	}

	return 0;
}

static int big_enable(const struct shell *shell, uint8_t big_index)
{
	int ret;

	if (big_index >= CONFIG_BT_ISO_MAX_BIG) {
		return -EINVAL;
	}

	if ((broadcast_param[big_index].subgroups == NULL) ||
	    (broadcast_param[big_index].num_subgroups == 0)) {
		LOG_ERR("No subgroups defined for BIG%d", big_index);
		return -EINVAL;
	}

	if (broadcast_source_is_streaming(big_index)) {
		LOG_WRN("BIG %d is already streaming", big_index);
		/* Do not return error code as this might be called from a for-loop */
		return 0;
	}

	ret = broadcast_source_enable(&broadcast_param[big_index], big_index);
	if (ret) {
		shell_error(shell, "Failed to enable broadcaster: %d", ret);
		return ret;
	}

	ret = adv_create_and_start(shell, big_index);
	if (ret) {
		shell_error(shell, "Failed to start advertising for BIG%d: %d", big_index, ret);
		return ret;
	}

	return 0;
}

static int cmd_start(const struct shell *shell, size_t argc, char **argv)
{
	int ret;

	if (argc == 2) {
		uint8_t big_index;

		ret = argv_to_indexes(shell, argc, argv, &big_index, 1, NULL, 0);
		if (ret) {
			return ret;
		}

		ret = big_enable(shell, big_index);
		if (ret) {
			return ret;
		}

	} else {
		for (int i = 0; i < CONFIG_BT_ISO_MAX_BIG; i++) {
			if (broadcast_param[i].subgroups != NULL ||
			    broadcast_param[i].num_subgroups > 0) {
				ret = big_enable(shell, i);
				if (ret) {
					return ret;
				}
			}
		}
	}

	led_blink(LED_AUDIO_APP_STATUS, LED_COLOR_GREEN);

	return 0;
}

static int broadcaster_stop(const struct shell *shell, uint8_t big_index)
{
	int ret;

	if (!broadcast_source_is_streaming(big_index)) {
		return 0;
	}

	ret = broadcast_source_disable(big_index);
	if (ret) {
		shell_error(shell, "Failed to stop broadcaster(s) %d", ret);
		return ret;
	}

	ret = bt_mgmt_per_adv_stop(big_index);
	if (ret) {
		shell_error(shell, "Failed to stop periodic advertiser");
		return ret;
	}

	ret = bt_mgmt_ext_adv_stop(big_index);
	if (ret) {
		shell_error(shell, "Failed to stop extended advertiser");
		return ret;
	}

	if (big_index == 0) {
		net_buf_simple_reset(&base_data0);
		net_buf_simple_reset(&uuid_data0);
	} else if (big_index == 1) {
		net_buf_simple_reset(&base_data1);
		net_buf_simple_reset(&uuid_data1);
	} else {
		shell_error(shell, "BIG index out of range");
		return -EINVAL;
	}

	per_adv_buf[big_index].data_len = 0;
	per_adv_buf[big_index].type = 0;

	memset(pba_data[big_index], 0, sizeof(pba_data[big_index]));

	for (size_t j = 0; j < ARRAY_SIZE(ext_adv_buf[big_index]); j++) {
		ext_adv_buf[big_index][j].data_len = 0;
		ext_adv_buf[big_index][j].type = 0;
	}

	return 0;
}

static int cmd_stop(const struct shell *shell, size_t argc, char **argv)
{
	int ret;

	if (argc == 2) {
		uint8_t big_index;

		ret = argv_to_indexes(shell, argc, argv, &big_index, 1, NULL, 0);
		if (ret) {
			return ret;
		}

		ret = broadcaster_stop(shell, big_index);

	} else {
		for (size_t i = 0; i < CONFIG_BT_ISO_MAX_BIG; i++) {
			if (broadcast_param[i].subgroups != NULL) {
				ret = broadcaster_stop(shell, i);
				if (ret) {
					return ret;
				}
			}
		}
	}

	led_on(LED_AUDIO_APP_STATUS, LED_COLOR_GREEN);

	return 0;
}

static int cmd_show(const struct shell *shell, size_t argc, char **argv)
{
	ARG_UNUSED(argc);
	ARG_UNUSED(argv);

	for (size_t i = 0; i < CONFIG_BT_ISO_MAX_BIG; i++) {
		if (broadcast_param[i].subgroups == NULL) {
			continue;
		}

		bool streaming = broadcast_source_is_streaming(i);

		shell_print(shell, "BIG %d:", i);
		shell_print(shell, "\tStreaming: %s", (streaming ? "true" : "false"));

		nrf_auraconfig_print(shell, i);
	}

	return 0;
}

static int cmd_preset(const struct shell *shell, size_t argc, char **argv)
{
	int ret;
	uint8_t big_index;

	if ((argc >= 2) && (strcmp(argv[1], "print") == 0)) {
		for (size_t i = 0; i < ARRAY_SIZE(bap_presets); i++) {
			shell_print(shell, "%s", bap_presets[i].name);
		}
		return 0;
	}

	if (argc < 3) {
		shell_error(shell,
			    "Usage: nac preset <preset> <BIG index> optional:<subgroup index>");
		return -EINVAL;
	}

	struct bt_bap_lc3_preset *preset = preset_find(argv[1]);

	if (!preset) {
		shell_error(shell,
			    "Preset not found, use 'nac preset print' to see available presets");
		return -EINVAL;
	}

	ret = argv_to_indexes(shell, argc, argv, &big_index, 2, NULL, 0);
	if (ret) {
		return ret;
	}

	broadcast_create(big_index);

	if (argc == 4) {
		uint8_t sub_index;

		ret = argv_to_indexes(shell, argc, argv, &big_index, 2, &sub_index, 3);

		broadcast_param[big_index].subgroups[sub_index].group_lc3_preset = *preset;
		broadcast_param[big_index].subgroups[sub_index].preset_name =
			preset_name_find(preset);
	} else {
		for (size_t i = 0; i < broadcast_param[big_index].num_subgroups; i++) {
			broadcast_param[big_index].subgroups[i].group_lc3_preset = *preset;
			broadcast_param[big_index].subgroups[i].preset_name =
				preset_name_find(preset);
		}
	}

	return 0;
}

static int cmd_packing(const struct shell *shell, size_t argc, char **argv)
{
	int ret;
	uint8_t big_index;

	if (argc < 3) {
		shell_error(shell, "Usage: nac packing <seq/int> <BIG index>");
		return -EINVAL;
	}

	ret = argv_to_indexes(shell, argc, argv, &big_index, 2, NULL, 0);
	if (ret) {
		return ret;
	}

