kyb110811/2026ESWContest_free_SAYFE/nrf5340/ncs/v3.4.0/nrf/samples/bluetooth/nrf_auraconfig/src/nrf_auraconfig.c
	if (strcmp(argv[1], "seq") == 0) {
		broadcast_param[big_index].packing = BT_ISO_PACKING_SEQUENTIAL;
	} else if (strcmp(argv[1], "int") == 0) {
		broadcast_param[big_index].packing = BT_ISO_PACKING_INTERLEAVED;
	} else {
		shell_error(shell, "Invalid packing type");
		return -EINVAL;
	}

	return 0;
}

static int cmd_lang(const struct shell *shell, size_t argc, char **argv)
{
	int ret;
	uint8_t big_index;
	uint8_t sub_index;

	if (argc < 4) {
		shell_error(shell, "Usage: nac lang <language> <BIG index> <subgroup index>");
		return -EINVAL;
	}

	if (strlen(argv[1]) != LANGUAGE_LEN) {
		shell_error(shell, "Language must be %d characters long", LANGUAGE_LEN);
		return -EINVAL;
	}

	char *language = argv[1];

	ret = argv_to_indexes(shell, argc, argv, &big_index, 2, &sub_index, 3);
	if (ret) {
		return ret;
	}

	bt_audio_codec_cfg_meta_set_lang(
		&broadcast_param[big_index].subgroups[sub_index].group_lc3_preset.codec_cfg,
		language);

	return 0;
}

static int cmd_immediate_set(const struct shell *shell, size_t argc, char **argv)
{
	int ret;
	uint8_t big_index;
	uint8_t sub_index;

	if (argc < 3) {
		shell_error(shell, "Usage: nac immediate <0/1> <BIG index> <subgroup index>");
		return -EINVAL;
	}

	bool immediate = strtoul(argv[1], NULL, 10);

	if ((immediate != 0) && (immediate != 1)) {
		shell_error(shell, "Immediate must be 0 or 1");
		return -EINVAL;
	}

	ret = argv_to_indexes(shell, argc, argv, &big_index, 2, &sub_index, 3);
	if (ret) {
		return ret;
	}

	if (immediate) {
		ret = bt_audio_codec_cfg_meta_set_bcast_audio_immediate_rend_flag(
			&broadcast_param[big_index]
				 .subgroups[sub_index]
				 .group_lc3_preset.codec_cfg);
		if (ret < 0) {
			shell_error(shell, "Failed to set immediate rendering flag: %d", ret);
			return ret;
		}
	} else {
		ret = bt_audio_codec_cfg_meta_unset_val(
			&broadcast_param[big_index].subgroups[sub_index].group_lc3_preset.codec_cfg,
			BT_AUDIO_METADATA_TYPE_BROADCAST_IMMEDIATE);
		if (ret < 0) {
			shell_error(shell, "Failed to unset immediate rendering flag: %d", ret);
			return ret;
		}
	}

	return 0;
}

static int cmd_num_subgroups(const struct shell *shell, size_t argc, char **argv)
{
	int ret;
	uint8_t big_index;

	if (argc < 3) {
		shell_error(shell, "Usage: nac num_subgroups <num> <BIG index>");
		return -EINVAL;
	}

	if (!is_number(argv[1])) {
		shell_error(shell, "Number of subgroups must be a digit");
		return -EINVAL;
	}

	uint8_t num_subgroups = (uint8_t)atoi(argv[1]);

	if (num_subgroups > CONFIG_BT_BAP_BROADCAST_SRC_SUBGROUP_COUNT) {
		shell_error(shell, "Max allowed subgroups is: %d",
			    CONFIG_BT_BAP_BROADCAST_SRC_SUBGROUP_COUNT);
		return -EINVAL;
	}

	ret = argv_to_indexes(shell, argc, argv, &big_index, 2, NULL, 0);
	if (ret) {
		return ret;
	}

	broadcast_param[big_index].num_subgroups = num_subgroups;

	return 0;
}

static int cmd_num_bises(const struct shell *shell, size_t argc, char **argv)
{
	int ret;
	uint8_t big_index;
	uint8_t sub_index;

	if (argc < 4) {
		shell_error(shell, "Usage: nac num_bises <num> <BIG index> <subgroup index>");
		return -EINVAL;
	}

	if (!is_number(argv[1])) {
		shell_error(shell, "Number of BISes must be a digit");
		return -EINVAL;
	}

	uint8_t num_bises = (uint8_t)atoi(argv[1]);

	if (!is_number(argv[2])) {
		shell_error(shell, "BIG index must be a digit");
		return -EINVAL;
	}

	if (num_bises > CONFIG_BT_BAP_BROADCAST_SRC_STREAM_COUNT) {
		shell_error(shell, "Max allowed BISes is: %d",
			    CONFIG_BT_BAP_BROADCAST_SRC_STREAM_COUNT);
		return -EINVAL;
	}

	ret = argv_to_indexes(shell, argc, argv, &big_index, 2, &sub_index, 3);
	if (ret) {
		return ret;
	}

	broadcast_param[big_index].subgroups[sub_index].num_bises = num_bises;

	return 0;
}

static int cmd_context(const struct shell *shell, size_t argc, char **argv)
{
	int ret;
	uint8_t big_index;
	uint8_t sub_index;
	uint16_t context = 0;

	if ((argc >= 2) && (strcmp(argv[1], "print") == 0)) {
		context_print(shell);
		return 0;
	}

	if (argc < 4) {
		shell_error(shell, "Usage: nac context <context> <BIG index> <subgroup index>");
		return -EINVAL;
	}

	/* Context container is a bit field */
	for (size_t i = 0U; i <= context_msb_one(BT_AUDIO_CONTEXT_TYPE_ANY); i++) {
		if (strcasecmp(argv[1], bt_audio_context_bit_to_str(BIT(i))) == 0) {
			context = BIT(i);
			break;
		}
	}

	if (!context) {
		shell_error(shell, "Context not found, use 'nac context print' to see "
				   "available contexts");
		return -EINVAL;
	}

	ret = argv_to_indexes(shell, argc, argv, &big_index, 2, &sub_index, 3);
	if (ret) {
		return ret;
	}

	broadcast_param[big_index].subgroups[sub_index].context = context;

	return 0;
}

static int location_find(const struct shell *shell, const char *name)
{
	for (size_t i = 0; i < ARRAY_SIZE(locations); i++) {
		if (strcasecmp(locations[i].name, name) == 0) {
			return locations[i].location;
		}
	}

	shell_error(shell, "Location not found");

	return -ESRCH;
}

static void location_print(const struct shell *shell)
{
	for (size_t i = 0; i < ARRAY_SIZE(locations); i++) {
		shell_print(shell, "%s - %s", locations[i].name,
			    bt_audio_location_bit_to_str(locations[i].location));
	}
}

static int cmd_location(const struct shell *shell, size_t argc, char **argv)
{
	int ret;
	uint8_t big_index;
	uint8_t sub_index;

	if ((argc >= 2) && (strcmp(argv[1], "print") == 0)) {
		location_print(shell);
		return 0;
	}

	if (argc < 4) {
		shell_error(shell, "Usage: nac location <location> <BIG index> <subgroup "
				   "index> <BIS index>");
		return -EINVAL;
	}

	ret = argv_to_indexes(shell, argc, argv, &big_index, 2, &sub_index, 3);
	if (ret) {
		return ret;
	}

	if (!is_number(argv[4])) {
		shell_error(shell, "BIS index must be a digit");
		return -EINVAL;
	}

	uint8_t bis_index = (uint8_t)atoi(argv[4]);

	if ((bis_index >= CONFIG_BT_BAP_BROADCAST_SRC_STREAM_COUNT) ||
	    (bis_index >= broadcast_param[big_index].subgroups[sub_index].num_bises)) {
		shell_error(shell, "BIS index out of range");
		return -EINVAL;
	}

	int location = location_find(shell, argv[1]);

	if (location < 0) {
		shell_error(shell, "Location not found");
		return -EINVAL;
	}

