kyb110811/2026ESWContest_free_SAYFE/nrf5340/ncs/v3.4.0/nrf/samples/bluetooth/nrf_auraconfig/src/nrf_auraconfig.c
	broadcast_param[big_index].subgroups[sub_index].location[bis_index] = location;

	return 0;
}

static int cmd_broadcast_name(const struct shell *shell, size_t argc, char **argv)
{
	int ret;
	uint8_t big_index;

	if (argc < 2) {
		shell_error(shell, "Usage: nac broadcast_name <name> <BIG index>");
		return -EINVAL;
	}

	ret = argv_to_indexes(shell, argc, argv, &big_index, 2, NULL, 0);
	if (ret) {
		return ret;
	}

	size_t name_length = strlen(argv[1]);

	/* Leave space for null termination */
	if (name_length >= ARRAY_SIZE(broadcast_param[big_index].broadcast_name) - 1) {
		shell_error(shell, "Name too long");
		return -EINVAL;
	}

	/* Delete old name if set */
	memset(broadcast_param[big_index].broadcast_name, '\0',
	       ARRAY_SIZE(broadcast_param[big_index].broadcast_name));
	memcpy(broadcast_param[big_index].broadcast_name, argv[1], name_length);

	return 0;
}

static int cmd_encrypt(const struct shell *shell, size_t argc, char **argv)
{
	int ret;
	uint8_t big_index;

	if (argc < 3) {
		shell_error(shell,
			    "Usage: nac encrypt <0/1> <BIG index> Optional:<broadcast_code>");
		return -EINVAL;
	}

	if (!is_number(argv[1])) {
		shell_error(shell, "Encryption must be 0 or 1");
		return -EINVAL;
	}

	uint8_t encrypt = (uint8_t)atoi(argv[1]);

	if (encrypt != 1 && encrypt != 0) {
		shell_error(shell, "Encryption must be 0 or 1");
		return -EINVAL;
	}

	ret = argv_to_indexes(shell, argc, argv, &big_index, 2, NULL, 0);
	if (ret) {
		return ret;
	}

	broadcast_param[big_index].encryption = encrypt;

	if (encrypt == 1) {
		if (argc < 4) {
			shell_error(shell, "Broadcast code must be set");
			return -EINVAL;
		}

		if (strlen(argv[3]) > BT_ISO_BROADCAST_CODE_SIZE) {
			shell_error(shell, "Broadcast code must be %d characters long",
				    BT_ISO_BROADCAST_CODE_SIZE);
			return -EINVAL;
		}
		memset(broadcast_param[big_index].broadcast_code, '\0',
		       ARRAY_SIZE(broadcast_param[big_index].broadcast_code));
		memcpy(broadcast_param[big_index].broadcast_code, argv[3], strlen(argv[3]));
	}

	return 0;
}

static int cmd_adv_name(const struct shell *shell, size_t argc, char **argv)
{
	int ret;
	uint8_t big_index;

	if (argc < 2) {
		shell_error(shell, "Usage: nac device_name <name> <BIG index>");
		return -EINVAL;
	}

	if (strlen(argv[1]) > CONFIG_BT_DEVICE_NAME_MAX) {
		shell_error(shell, "Device name too long");
		return -EINVAL;
	}

	ret = argv_to_indexes(shell, argc, argv, &big_index, 2, NULL, 0);
	if (ret) {
		return ret;
	}

	memset(broadcast_param[big_index].adv_name, '\0',
	       ARRAY_SIZE(broadcast_param[big_index].adv_name));
	memcpy(broadcast_param[big_index].adv_name, argv[1], strlen(argv[1]));

	return 0;
}

static int cmd_program_info(const struct shell *shell, size_t argc, char **argv)
{
	int ret;
	uint8_t big_index;
	uint8_t sub_index;

	if (argc != 4) {
		shell_error(shell, "Usage: nac program_info \"info\" <BIG index> <subgroup index>");
		return -EINVAL;
	}

	ret = argv_to_indexes(shell, argc, argv, &big_index, 2, &sub_index, 3);
	if (ret) {
		return ret;
	}

	ret = bt_audio_codec_cfg_meta_set_program_info(
		&broadcast_param[big_index].subgroups[sub_index].group_lc3_preset.codec_cfg,
		argv[1], strlen(argv[1]));
	if (ret < 0) {
		shell_error(shell, "Failed to set program info: %d", ret);
		return ret;
	}

	return 0;
}

#define FILE_LIST_BUF_SIZE 1024

static int cmd_file_list(const struct shell *shell, size_t argc, char **argv)
{

	int ret;
	char buf[FILE_LIST_BUF_SIZE];
	size_t buf_size = FILE_LIST_BUF_SIZE;
	char *dir_path = NULL;

	if (!sd_card_present) {
		shell_error(shell, "No SD card present: files cannot be listed");
		return -EFAULT;
	}

	if (argc > 2) {
		shell_error(shell, "Usage: nac file list [dir path]");
		return -EINVAL;
	}

	if (argc == 2) {
		dir_path = argv[1];
	}

	ret = sd_card_list_files(dir_path, buf, &buf_size, true);
	if (ret) {
		shell_error(shell, "List files err: %d", ret);
		return ret;
	}

	shell_print(shell, "%s", buf);

	return 0;
}

static int cmd_file_select(const struct shell *shell, size_t argc, char **argv)
{
	int ret;
	uint8_t big_index;
	uint8_t sub_index;
	uint8_t bis_index;

	if (!sd_card_present) {
		shell_error(shell, "No SD card present: files cannot be selected");
		return -EFAULT;
	}

	if (argc != 5) {
		shell_error(shell,
			    "Usage: nac file select <file path> <BIG index> <subgroup index> "
			    "<BIS index>");
		return -EINVAL;
	}

	ret = argv_to_indexes(shell, argc, argv, &big_index, 2, &sub_index, 3);
	if (ret) {
		shell_error(shell, "Failed to get indexes: %d", ret);
		return ret;
	}

	if (broadcast_source_is_streaming(big_index)) {
		shell_error(shell, "Files cannot be selected while streaming");
		return -EFAULT;
	}

	if (!is_number(argv[4])) {
		shell_error(shell, "BIS index must be a digit");
		return -EINVAL;
	}

	bis_index = (uint8_t)atoi(argv[4]);

	if ((bis_index >= CONFIG_BT_BAP_BROADCAST_SRC_STREAM_COUNT) ||
	    (bis_index >= broadcast_param[big_index].subgroups[sub_index].num_bises)) {
		shell_error(shell, "BIS index %d is out of range (max %d)", bis_index,
			    broadcast_param[big_index].subgroups[sub_index].num_bises - 1);
		return -EINVAL;
	}

	char *file_name = argv[1];

	LOG_DBG("Selecting file %s for stream big: %d sub: %d bis: %d", file_name, big_index,
		sub_index, bis_index);

	struct bt_audio_codec_cfg *codec_cfg =
		&broadcast_param[big_index].subgroups[sub_index].group_lc3_preset.codec_cfg;

	struct lc3_stream_cfg cfg;

	ret = le_audio_freq_hz_get(codec_cfg, &cfg.sample_rate_hz);
	if (ret) {
		shell_error(shell, "Failed to get frequency: %d", ret);
		return ret;
	}

	ret = le_audio_duration_us_get(codec_cfg, &cfg.frame_duration_us);
	if (ret) {
		shell_error(shell, "Failed to get frame duration: %d", ret);
	}

	ret = le_audio_bitrate_get(codec_cfg, &cfg.bit_rate_bps);
	if (ret) {
		shell_error(shell, "Failed to get bit rate: %d", ret);
	}

	/* Verify that the file header matches the stream configurationn */
	/* NOTE: This will not abort the streamer if the file is not valid, only give a warning */
	bool header_valid = lc3_streamer_file_compatible_check(file_name, &cfg);

	if (!header_valid) {
		shell_warn(shell, "File header verification failed. File may not be compatible "
				  "with stream config.");
	}

	ret = lc3_streamer_stream_register(
		file_name, &lc3_stream_infos[big_index][sub_index].lc3_streamer_idx[bis_index],
		true);
	if (ret) {
		shell_error(shell, "Failed to register stream: %d", ret);
		return ret;
	}

	lc3_stream_infos[big_index][sub_index].frame_size =
		broadcast_param[big_index].subgroups[sub_index].group_lc3_preset.qos.sdu;

