kyb110811/2026ESWContest_free_SAYFE/nrf5340/ncs/v3.4.0/nrf/samples/bluetooth/nrf_auraconfig/src/nrf_auraconfig.c
	return 0;
}

static int cmd_phy(const struct shell *shell, size_t argc, char **argv)
{
	int ret;
	uint8_t big_index;
	uint8_t sub_index;

	if (argc != 4) {
		shell_error(shell,
			    "Usage: nac phy <1, 2 or 4 (coded)> <BIG index> <subgroup index>");
		return -EINVAL;
	}

	if (!is_number(argv[1])) {
		shell_error(shell, "PHY must be a digit");
		return -EINVAL;
	}

	uint8_t phy = (uint8_t)atoi(argv[1]);

	if (phy != BT_BAP_QOS_CFG_1M && phy != BT_BAP_QOS_CFG_2M && phy != BT_BAP_QOS_CFG_CODED) {
		shell_error(shell, "Invalid PHY");
		return -EINVAL;
	}

	ret = argv_to_indexes(shell, argc, argv, &big_index, 2, &sub_index, 3);
	if (ret) {
		return ret;
	}

	broadcast_param[big_index].subgroups[sub_index].group_lc3_preset.qos.phy = phy;
	broadcast_param[big_index].subgroups[sub_index].preset_name = "Custom";

	return 0;
}

static int cmd_framing(const struct shell *shell, size_t argc, char **argv)
{
	int ret;
	uint8_t big_index;
	uint8_t sub_index;

	if (argc != 4) {
		shell_error(shell,
			    "Usage: nac framing <unframed/framed> <BIG index> <subgroup index>");
		return -EINVAL;
	}

	ret = argv_to_indexes(shell, argc, argv, &big_index, 2, &sub_index, 3);
	if (ret) {
		return ret;
	}

	if (strcasecmp(argv[1], "unframed") == 0) {
		broadcast_param[big_index].subgroups[sub_index].group_lc3_preset.qos.framing =
			BT_BAP_QOS_CFG_FRAMING_UNFRAMED;
		broadcast_param[big_index].subgroups[sub_index].preset_name = "Custom";
	} else if (strcasecmp(argv[1], "framed") == 0) {
		broadcast_param[big_index].subgroups[sub_index].group_lc3_preset.qos.framing =
			BT_BAP_QOS_CFG_FRAMING_FRAMED;
		broadcast_param[big_index].subgroups[sub_index].preset_name = "Custom";
	} else {
		shell_error(shell, "Invalid framing type");
		return -EINVAL;
	}

	return 0;
}

static int cmd_rtn(const struct shell *shell, size_t argc, char **argv)
{
	int ret;
	uint8_t big_index;
	uint8_t sub_index;

	if (argc != 4) {
		shell_error(shell, "Usage: nac rtn <num> <BIG index> <subgroup index>");
		return -EINVAL;
	}

	if (!is_number(argv[1])) {
		shell_error(shell, "RTN must be a digit");
		return -EINVAL;
	}

	if (strtoul(argv[1], NULL, 10) > UINT8_MAX) {
		shell_error(shell, "RTN must be less than %d", UINT8_MAX);
		return -EINVAL;
	}

	uint8_t rtn = (uint8_t)atoi(argv[1]);

	ret = argv_to_indexes(shell, argc, argv, &big_index, 2, &sub_index, 3);
	if (ret) {
		return ret;
	}

	broadcast_param[big_index].subgroups[sub_index].group_lc3_preset.qos.rtn = rtn;
	broadcast_param[big_index].subgroups[sub_index].preset_name = "Custom";

	return 0;
}

static int cmd_sdu(const struct shell *shell, size_t argc, char **argv)
{
	int ret;
	uint8_t big_index;
	uint8_t sub_index;

	if (argc != 4) {
		shell_error(shell, "Usage: nac sdu <octets> <BIG index> <subgroup index>");
		return -EINVAL;
	}

	if (!is_number(argv[1])) {
		shell_error(shell, "SDU must be a digit");
		return -EINVAL;
	}

	if (strtoul(argv[1], NULL, 10) > UINT16_MAX) {
		shell_error(shell, "SDU must be less than %d", UINT16_MAX);
		return -EINVAL;
	}

	uint16_t sdu = (uint16_t)atoi(argv[1]);

	ret = argv_to_indexes(shell, argc, argv, &big_index, 2, &sub_index, 3);
	if (ret) {
		return ret;
	}

	broadcast_param[big_index].subgroups[sub_index].group_lc3_preset.qos.sdu = sdu;
	broadcast_param[big_index].subgroups[sub_index].preset_name = "Custom";

	return 0;
}

static int cmd_mtl(const struct shell *shell, size_t argc, char **argv)
{
	int ret;
	uint8_t big_index;
	uint8_t sub_index;

	if (argc != 4) {
		shell_error(shell, "Usage: nac mtl <time in ms> <BIG index> <subgroup index>");
		return -EINVAL;
	}

	if (!is_number(argv[1])) {
		shell_error(shell, "MTL must be a digit");
		return -EINVAL;
	}

	if (strtoul(argv[1], NULL, 10) > UINT16_MAX) {
		shell_error(shell, "MTL must be less than %d", UINT16_MAX);
		return -EINVAL;
	}

	uint16_t mtl = (uint16_t)atoi(argv[1]);

	ret = argv_to_indexes(shell, argc, argv, &big_index, 2, &sub_index, 3);
	if (ret) {
		return ret;
	}

	broadcast_param[big_index].subgroups[sub_index].group_lc3_preset.qos.latency = mtl;
	broadcast_param[big_index].subgroups[sub_index].preset_name = "Custom";

	return 0;
}

static int cmd_frame_interval(const struct shell *shell, size_t argc, char **argv)
{
	int ret;
	uint8_t big_index;
	uint8_t sub_index;

	if (argc != 4) {
		shell_error(shell,
			    "Usage: nac frame_interval <time in us> <BIG index> <subgroup index>");
		return -EINVAL;
	}

	if (!is_number(argv[1])) {
		shell_error(shell, "Frame interval must be a digit");
		return -EINVAL;
	}

	if (strtoul(argv[1], NULL, 10) > UINT32_MAX) {
		shell_error(shell, "Frame interval must be less than %ld", UINT32_MAX);
		return -EINVAL;
	}

	uint32_t frame_interval = (uint32_t)atoi(argv[1]);

	if (frame_interval != 7500 && frame_interval != 10000) {
		shell_error(shell, "Frame interval must be 7500 or 10000");
		return -EINVAL;
	}

	ret = argv_to_indexes(shell, argc, argv, &big_index, 2, &sub_index, 3);
	if (ret) {
		return ret;
	}

	broadcast_param[big_index].subgroups[sub_index].group_lc3_preset.qos.interval =
		frame_interval;
	broadcast_param[big_index].subgroups[sub_index].preset_name = "Custom";

	return 0;
}

static int cmd_pd(const struct shell *shell, size_t argc, char **argv)
{
	int ret;
	uint8_t big_index;
	uint8_t sub_index;

	if (argc != 4) {
		shell_error(shell, "Usage: nac pd <time us> <BIG index> <subgroup index>");
		return -EINVAL;
	}

	if (!is_number(argv[1])) {
		shell_error(shell, "presentation delay must be a digit");
		return -EINVAL;
	}

	if (strtoul(argv[1], NULL, 10) > UINT32_MAX) {
		shell_error(shell, "Presentation delay must be less than %ld", UINT32_MAX);
		return -EINVAL;
	}

	uint32_t pd = (uint32_t)atoi(argv[1]);

	ret = argv_to_indexes(shell, argc, argv, &big_index, 2, &sub_index, 3);
	if (ret) {
		return ret;
	}

	broadcast_param[big_index].subgroups[sub_index].group_lc3_preset.qos.pd = pd;
	broadcast_param[big_index].subgroups[sub_index].preset_name = "Custom";

	return 0;
}

static int cmd_random_id(const struct shell *shell, size_t argc, char **argv)
{
	uint8_t big_index;

	if (argc < 2) {
		shell_error(shell, "Usage: nac broadcast_id random <BIG index>");
		return -EINVAL;
	}

	if (!is_number(argv[1])) {
		shell_error(shell, "BIG index must be a digit");
		return -EINVAL;
	}

	big_index = (uint8_t)atoi(argv[1]);

	if (big_index >= CONFIG_BT_ISO_MAX_BIG) {
		shell_error(shell, "BIG index out of range");
		return -EINVAL;
	}

	if (broadcast_source_is_streaming(big_index)) {
		shell_error(shell, "Broadcast ID can not be changed while streaming");
		return -EFAULT;
	}

	broadcast_param[big_index].fixed_id = false;

