kyb110811/2026ESWContest_free_SAYFE/nrf5340/ncs/v3.4.0/nrf/samples/bluetooth/nrf_auraconfig/src/nrf_auraconfig.c
	return 0;
}

static int cmd_fixed_id(const struct shell *shell, size_t argc, char **argv)
{
	uint8_t big_index;

	if (argc < 3) {
		shell_error(shell, "Usage: nac broadcast_id fixed <BIG index> <broadcast_id in hex "
				   "(3 octets)>");
		return -EINVAL;
	}

	if (!is_number(argv[1])) {
		shell_error(shell, "BIG index must be a digit");
		return -EINVAL;
	}

	big_index = (uint8_t)atoi(argv[1]);

	if (big_index >= CONFIG_BT_ISO_MAX_BIG) {
		shell_error(shell, "BIG index out of range");
		return -EINVAL;
	}

	if (broadcast_source_is_streaming(big_index)) {
		shell_error(shell, "Broadcast ID can not be changed while streaming");
		return -EFAULT;
	}

	uint8_t len;

	if (!is_hex(argv[2], &len)) {
		shell_error(shell, "Broadcast ID must be a hexadecimal value");
		return -EINVAL;
	}

	if (len > 6) {
		shell_error(shell, "Broadcast ID must be three octets long at maximum");
		return -EINVAL;
	}

	uint32_t broadcast_id = (uint32_t)strtoul(argv[2], NULL, 16);

	broadcast_param[big_index].broadcast_id = broadcast_id;

	broadcast_param[big_index].fixed_id = true;

	return 0;
}

static int usecase_find(const struct shell *shell, const char *name)
{
	for (size_t i = 0; i < ARRAY_SIZE(pre_defined_use_cases); i++) {
		if (strcasecmp(pre_defined_use_cases[i].name, name) == 0) {
			return pre_defined_use_cases[i].use_case;
		}
	}

	shell_error(shell, "Use case not found");

	return -ESRCH;
}

static void usecase_print(const struct shell *shell)
{
	for (size_t i = 0; i < ARRAY_SIZE(pre_defined_use_cases); i++) {
		shell_print(shell, "%d - %s", pre_defined_use_cases[i].use_case,
			    pre_defined_use_cases[i].name);
	}
}

static void lecture_set(const struct shell *shell)
{
	char *preset_argv[3] = {"preset", "24_2_1", "0"};
	char *adv_name_argv[3] = {"adv_name", "Lecture hall", "0"};
	char *name_argv[3] = {"broadcast_name", "Lecture", "0"};
	char *broadcast_id_argv[3] = {"fixed", "0", "0x123456"};
	char *packing_argv[3] = {"packing", "int", "0"};

	char *lang_argv[4] = {"lang", "eng", "0", "0"};

	char *context_argv[4] = {"context", "live", "0", "0"};

	char *program_info_argv[4] = {"program_info", "Mathematics 101", "0", "0"};

	char *imm_argv[4] = {"immediate", "1", "0", "0"};

	char *num_bis_argv[4] = {"num_bises", "1", "0", "0"};

	char *fileselect_argv[5] = {
		"file select", "10ms/24000hz/48_kbps/auditorium-english_24kHz_left_48kbps_10ms.lc3",
		"0", "0", "0"};

	cmd_preset(shell, 3, preset_argv);
	cmd_adv_name(shell, 3, adv_name_argv);
	cmd_broadcast_name(shell, 3, name_argv);
	cmd_fixed_id(shell, 3, broadcast_id_argv);
	cmd_packing(shell, 3, packing_argv);

	cmd_lang(shell, 4, lang_argv);

	cmd_context(shell, 4, context_argv);

	cmd_program_info(shell, 4, program_info_argv);

	cmd_immediate_set(shell, 4, imm_argv);

	cmd_num_bises(shell, 4, num_bis_argv);

	if (sd_card_present) {
		cmd_file_select(shell, 5, fileselect_argv);
	}
}

static void silent_tv_1_set(const struct shell *shell)
{
	char *preset_argv[3] = {"preset", "24_2_1", "0"};
	char *adv_name_argv[3] = {"adv_name", "Silent TV1", "0"};
	char *name_argv[3] = {"broadcast_name", "TV-audio", "0"};
	char *packing_argv[3] = {"packing", "int", "0"};
	char *encrypt_argv[4] = {"encrypt", "1", "0", "Auratest"};

	char *context_argv[4] = {"context", "media", "0", "0"};

	char *program_info_argv[4] = {"program_info", "News", "0", "0"};

	char *imm_argv[4] = {"immediate", "1", "0", "0"};

	char *num_bis_argv[4] = {"num_bises", "2", "0", "0"};

	char *location_FL_argv[5] = {"location", "FL", "0", "0", "0"};
	char *location_FR_argv[5] = {"location", "FR", "0", "0", "1"};

	char *fileselect0_argv[5] = {"file select",
				     "10ms/24000hz/48_kbps/left-channel_24kHz_left_48kbps_10ms.lc3",
				     "0", "0", "0"};
	char *fileselect1_argv[5] = {
		"file select", "10ms/24000hz/48_kbps/right-channel_24kHz_left_48kbps_10ms.lc3", "0",
		"0", "1"};

	cmd_preset(shell, 3, preset_argv);
	cmd_adv_name(shell, 3, adv_name_argv);
	cmd_broadcast_name(shell, 3, name_argv);
	cmd_packing(shell, 3, packing_argv);
	cmd_encrypt(shell, 4, encrypt_argv);

	cmd_context(shell, 4, context_argv);

	cmd_program_info(shell, 4, program_info_argv);

	cmd_immediate_set(shell, 4, imm_argv);

	cmd_num_bises(shell, 4, num_bis_argv);

	cmd_location(shell, 5, location_FL_argv);
	cmd_location(shell, 5, location_FR_argv);

	if (sd_card_present) {
		cmd_file_select(shell, 5, fileselect0_argv);
		cmd_file_select(shell, 5, fileselect1_argv);
	}
}

static void silent_tv_2_set(const struct shell *shell)
{
	/* BIG0 */
	char *preset0_argv[3] = {"preset", "24_2_1", "0"};
	char *adv_name0_argv[3] = {"adv_name", "Silent_TV2_std", "0"};
	char *name0_argv[3] = {"broadcast_name", "TV - standard qual.", "0"};
	char *packing0_argv[3] = {"packing", "int", "0"};
	char *encrypt0_argv[4] = {"encrypt", "1", "0", "Auratest"};

	char *context0_argv[4] = {"context", "media", "0", "0"};

	char *program_info0_argv[4] = {"program_info", "Biathlon", "0", "0"};

	char *imm0_argv[4] = {"immediate", "1", "0", "0"};

	char *num_bis0_argv[4] = {"num_bises", "2", "0", "0"};

	char *location_FL0_argv[5] = {"location", "FL", "0", "0", "0"};
	char *location_FR0_argv[5] = {"location", "FR", "0", "0", "1"};

	char *fileselect00_argv[5] = {
		"file select", "10ms/24000hz/48_kbps/left-channel_24kHz_left_48kbps_10ms.lc3", "0",
		"0", "0"};
	char *fileselect01_argv[5] = {
		"file select", "10ms/24000hz/48_kbps/right-channel_24kHz_left_48kbps_10ms.lc3", "0",
		"0", "1"};

	cmd_preset(shell, 3, preset0_argv);
	cmd_adv_name(shell, 3, adv_name0_argv);
	cmd_broadcast_name(shell, 3, name0_argv);
	cmd_packing(shell, 3, packing0_argv);
	cmd_encrypt(shell, 4, encrypt0_argv);

	cmd_context(shell, 4, context0_argv);

	cmd_program_info(shell, 4, program_info0_argv);

	cmd_immediate_set(shell, 4, imm0_argv);

	cmd_num_bises(shell, 4, num_bis0_argv);

	cmd_location(shell, 5, location_FL0_argv);
	cmd_location(shell, 5, location_FR0_argv);

	if (sd_card_present) {
		cmd_file_select(shell, 5, fileselect00_argv);
		cmd_file_select(shell, 5, fileselect01_argv);
	}

