kyb110811/2026ESWContest_free_SAYFE/nrf5340/ncs/v3.4.0/nrf/samples/bluetooth/nrf_auraconfig/src/nrf_auraconfig.c
	/* BIG1 */
	char *preset1_argv[3] = {"preset", "48_2_1", "1"};
	char *adv_name1_argv[3] = {"adv_name", "Silent_TV2_high", "1"};
	char *name1_argv[3] = {"broadcast_name", "TV - high qual.", "1"};
	char *packing1_argv[3] = {"packing", "int", "1"};
	char *encrypt1_argv[4] = {"encrypt", "1", "1", "Auratest"};

	char *context1_argv[4] = {"context", "media", "1", "0"};

	char *program_info1_argv[4] = {"program_info", "Biathlon", "1", "0"};

	char *imm1_argv[4] = {"immediate", "1", "1", "0"};

	char *num_bis1_argv[4] = {"num_bises", "2", "1", "0"};

	char *location_FL1_argv[5] = {"location", "FL", "1", "0", "0"};
	char *location_FR1_argv[5] = {"location", "FR", "1", "0", "1"};

	char *fileselect10_argv[5] = {
		"file select", "10ms/48000hz/80_kbps/left-channel_48kHz_left_80kbps_10ms.lc3", "1",
		"0", "0"};
	char *fileselect11_argv[5] = {
		"file select", "10ms/48000hz/80_kbps/right-channel_48kHz_left_80kbps_10ms.lc3", "1",
		"0", "1"};
	char *num_rtn_argv[4] = {"rtn", "2", "1", "0"};

	cmd_preset(shell, 3, preset1_argv);
	cmd_adv_name(shell, 3, adv_name1_argv);
	cmd_broadcast_name(shell, 3, name1_argv);
	cmd_packing(shell, 3, packing1_argv);
	cmd_encrypt(shell, 4, encrypt1_argv);

	cmd_context(shell, 4, context1_argv);

	cmd_program_info(shell, 4, program_info1_argv);

	cmd_immediate_set(shell, 4, imm1_argv);

	cmd_num_bises(shell, 4, num_bis1_argv);

	cmd_location(shell, 5, location_FL1_argv);
	cmd_location(shell, 5, location_FR1_argv);

	cmd_rtn(shell, 4, num_rtn_argv);

	if (sd_card_present) {
		cmd_file_select(shell, 5, fileselect10_argv);
		cmd_file_select(shell, 5, fileselect11_argv);
	}
}

static void multi_language_set(const struct shell *shell)
{
	char *num_subs_argv[3] = {"num_subgroups", "3", "0"};
	char *preset_argv[3] = {"preset", "24_2_2", "0"};
	char *adv_name_argv[3] = {"adv_name", "Multi-language", "0"};
	char *name_argv[3] = {"broadcast_name", "Multi-language", "0"};
	char *packing_argv[3] = {"packing", "int", "0"};

	char *lang0_argv[4] = {"lang", "eng", "0", "0"};
	char *lang1_argv[4] = {"lang", "chi", "0", "1"};
	char *lang2_argv[4] = {"lang", "nor", "0", "2"};

	char *context0_argv[4] = {"context", "unspecified", "0", "0"};
	char *context1_argv[4] = {"context", "unspecified", "0", "1"};
	char *context2_argv[4] = {"context", "unspecified", "0", "2"};

	char *num_bis0_argv[4] = {"num_bises", "1", "0", "0"};
	char *num_bis1_argv[4] = {"num_bises", "1", "0", "1"};
	char *num_bis2_argv[4] = {"num_bises", "1", "0", "2"};

	char *num_rtn0_argv[4] = {"rtn", "2", "0", "0"};
	char *num_rtn1_argv[4] = {"rtn", "2", "0", "1"};
	char *num_rtn2_argv[4] = {"rtn", "2", "0", "2"};

	char *fileselect0_argv[5] = {
		"file select", "10ms/24000hz/48_kbps/gate-b23-english_24kHz_left_48kbps_10ms.lc3",
		"0", "0", "0"};
	char *fileselect1_argv[5] = {
		"file select", "10ms/24000hz/48_kbps/gate-b23-mandarin_24kHz_left_48kbps_10ms.lc3",
		"0", "1", "0"};
	char *fileselect2_argv[5] = {
		"file select",
		"10ms/24000hz/48_kbps/adventuresherlockholmes_01_doyle_24kHz_left_48kbps_10ms.lc3",
		"0", "2", "0"};

	cmd_num_subgroups(shell, 3, num_subs_argv);
	cmd_preset(shell, 3, preset_argv);
	cmd_adv_name(shell, 3, adv_name_argv);
	cmd_broadcast_name(shell, 3, name_argv);
	cmd_packing(shell, 3, packing_argv);

	cmd_lang(shell, 4, lang0_argv);
	cmd_lang(shell, 4, lang1_argv);
	cmd_lang(shell, 4, lang2_argv);

	cmd_context(shell, 4, context0_argv);
	cmd_context(shell, 4, context1_argv);
	cmd_context(shell, 4, context2_argv);

	cmd_num_bises(shell, 4, num_bis0_argv);
	cmd_num_bises(shell, 4, num_bis1_argv);
	cmd_num_bises(shell, 4, num_bis2_argv);

	cmd_rtn(shell, 4, num_rtn0_argv);
	cmd_rtn(shell, 4, num_rtn1_argv);
	cmd_rtn(shell, 4, num_rtn2_argv);

	if (sd_card_present) {
		cmd_file_select(shell, 5, fileselect0_argv);
		cmd_file_select(shell, 5, fileselect1_argv);
		cmd_file_select(shell, 5, fileselect2_argv);
	}
}

static void personal_sharing_set(const struct shell *shell)
{
	char *preset_argv[3] = {"preset", "48_2_2", "0"};
	char *adv_name_argv[3] = {"adv_name", "John's phone", "0"};
	char *name_argv[3] = {"broadcast_name", "Personal sharing", "0"};
	char *packing_argv[3] = {"packing", "int", "0"};
	char *encrypt_argv[4] = {"encrypt", "1", "0", "Auratest"};

	char *context_argv[4] = {"context", "media", "0", "0"};

	char *num_bis_argv[4] = {"num_bises", "2", "0", "0"};

	char *location_FL_argv[5] = {"location", "FL", "0", "0", "0"};
	char *location_FR_argv[5] = {"location", "FR", "0", "0", "1"};

	char *fileselect0_argv[5] = {
		"file select",
		"10ms/48000hz/80_kbps/groovy-ambient-funk-201745_48kHz_left_80kbps_10ms.lc3", "0",
		"0", "0"};
	char *fileselect1_argv[5] = {
		"file select",
		"10ms/48000hz/80_kbps/groovy-ambient-funk-201745_48kHz_right_80kbps_10ms.lc3", "0",
		"0", "1"};

	cmd_preset(shell, 3, preset_argv);
	cmd_adv_name(shell, 3, adv_name_argv);
	cmd_broadcast_name(shell, 3, name_argv);
	cmd_packing(shell, 3, packing_argv);
	cmd_encrypt(shell, 4, encrypt_argv);

	cmd_context(shell, 4, context_argv);

	cmd_num_bises(shell, 4, num_bis_argv);

	cmd_location(shell, 5, location_FL_argv);
	cmd_location(shell, 5, location_FR_argv);

	if (sd_card_present) {
		cmd_file_select(shell, 5, fileselect0_argv);
		cmd_file_select(shell, 5, fileselect1_argv);
	}
}

static void personal_multi_language_set(const struct shell *shell)
{
	char *num_subs_argv[3] = {"num_subgroups", "2", "0"};
	char *preset_argv[3] = {"preset", "24_2_2", "0"};
	char *adv_name_argv[3] = {"adv_name", "Brian's laptop", "0"};
	char *name_argv[3] = {"broadcast_name", "Personal multi-lang.", "0"};
	char *packing_argv[3] = {"packing", "int", "0"};
	char *encrypt_argv[4] = {"encrypt", "1", "0", "Auratest"};

	char *lang0_argv[4] = {"lang", "eng", "0", "0"};
	char *lang1_argv[4] = {"lang", "chi", "0", "1"};

	char *context0_argv[4] = {"context", "media", "0", "0"};
	char *context1_argv[4] = {"context", "media", "0", "1"};

	char *num_bis0_argv[4] = {"num_bises", "2", "0", "0"};
	char *num_bis1_argv[4] = {"num_bises", "2", "0", "1"};

	char *location_FL0_argv[5] = {"location", "FL", "0", "0", "0"};
	char *location_FR0_argv[5] = {"location", "FR", "0", "0", "1"};
	char *location_FL1_argv[5] = {"location", "FL", "0", "1", "0"};
	char *location_FR1_argv[5] = {"location", "FR", "0", "1", "1"};

