kyb110811/2026ESWContest_free_SAYFE/nrf5340/ncs/v3.4.0/nrf/samples/bluetooth/nrf_auraconfig/src/nrf_auraconfig.c
	char *fileselect000_argv[5] = {
		"file select", "10ms/24000hz/48_kbps/auditorium-english_24kHz_left_48kbps_10ms.lc3",
		"0", "0", "0"};
	char *fileselect001_argv[5] = {
		"file select",
		"10ms/24000hz/48_kbps/auditorium-english_24kHz_right_48kbps_10ms.lc3", "0", "0",
		"1"};
	char *fileselect010_argv[5] = {
		"file select",
		"10ms/24000hz/48_kbps/auditorium-mandarin_24kHz_left_48kbps_10ms.lc3", "0", "1",
		"0"};
	char *fileselect011_argv[5] = {
		"file select",
		"10ms/24000hz/48_kbps/auditorium-mandarin_24kHz_right_48kbps_10ms.lc3", "0", "1",
		"1"};

	char *num_rtn000_argv[4] = {"rtn", "2", "0", "0"};
	char *num_rtn010_argv[4] = {"rtn", "2", "0", "1"};

	cmd_num_subgroups(shell, 3, num_subs_argv);
	cmd_preset(shell, 3, preset_argv);
	cmd_adv_name(shell, 3, adv_name_argv);
	cmd_broadcast_name(shell, 3, name_argv);
	cmd_packing(shell, 3, packing_argv);
	cmd_encrypt(shell, 4, encrypt_argv);

	cmd_lang(shell, 4, lang0_argv);
	cmd_lang(shell, 4, lang1_argv);

	cmd_context(shell, 4, context0_argv);
	cmd_context(shell, 4, context1_argv);

	cmd_num_bises(shell, 4, num_bis0_argv);
	cmd_num_bises(shell, 4, num_bis1_argv);

	cmd_location(shell, 5, location_FL0_argv);
	cmd_location(shell, 5, location_FR0_argv);
	cmd_location(shell, 5, location_FL1_argv);
	cmd_location(shell, 5, location_FR1_argv);

	cmd_rtn(shell, 4, num_rtn000_argv);
	cmd_rtn(shell, 4, num_rtn010_argv);

	if (sd_card_present) {
		cmd_file_select(shell, 5, fileselect000_argv);
		cmd_file_select(shell, 5, fileselect001_argv);
		cmd_file_select(shell, 5, fileselect010_argv);
		cmd_file_select(shell, 5, fileselect011_argv);
	}
}

static int cmd_usecase(const struct shell *shell, size_t argc, char **argv)
{
	if ((argc >= 2) && (strcmp(argv[1], "print") == 0)) {
		usecase_print(shell);
		return 0;
	}

	if (argc < 2) {
		shell_error(shell, "Usage: nac usecase <use_case> - Either index or text");
		return -EINVAL;
	}

	int use_case_nr = -1;

	if (is_number(argv[1])) {
		use_case_nr = atoi(argv[1]);
	} else {
		use_case_nr = usecase_find(shell, argv[1]);

		if (use_case_nr < 0) {
			return -EINVAL;
		}
	}

	if (use_case_nr > ARRAY_SIZE(pre_defined_use_cases)) {
		shell_error(shell, "Use case not found");
		return -EINVAL;
	}

	/* Clear previous configurations */
	nrf_auraconfig_clear();

	switch (use_case_nr) {
	case LECTURE:
		lecture_set(shell);
		break;
	case SILENT_TV_1:
		silent_tv_1_set(shell);
		break;
	case SILENT_TV_2:
		silent_tv_2_set(shell);
		break;
	case MULTI_LANGUAGE:
		multi_language_set(shell);
		break;
	case PERSONAL_SHARING:
		personal_sharing_set(shell);
		break;
	case PERSONAL_MULTI_LANGUAGE:
		personal_multi_language_set(shell);
		break;
	default:
		shell_error(shell, "Use case not found");
		return -EINVAL;
	}

	cmd_show(shell, 0, NULL);

	return 0;
}

static int cmd_clear(const struct shell *shell, size_t argc, char **argv)
{
	ARG_UNUSED(argc);
	ARG_UNUSED(argv);

	nrf_auraconfig_clear();

	return 0;
}

static void file_paths_get(size_t idx, struct shell_static_entry *entry);

SHELL_DYNAMIC_CMD_CREATE(folder_names, file_paths_get);

static void file_paths_get(size_t idx, struct shell_static_entry *entry)
{
	if (idx < num_files_added) {
		entry->syntax = sd_paths_and_files[idx];
	} else {
		entry->syntax = NULL;
	}

	entry->handler = NULL;
	entry->help = NULL;
	entry->subcmd = &folder_names;
}

SHELL_STATIC_SUBCMD_SET_CREATE(sub_file_cmd,
			       SHELL_COND_CMD(CONFIG_SHELL, list, NULL, "List files on SD card",
					      cmd_file_list),
			       /* 5 required arguments */
			       SHELL_CMD_ARG(select, &folder_names, "Select file on SD card",
					     cmd_file_select, 5, 0),
			       SHELL_SUBCMD_SET_END);

SHELL_STATIC_SUBCMD_SET_CREATE(
	sub_broadcast_id_cmd,
	SHELL_COND_CMD(CONFIG_SHELL, random, NULL,
		       "Set the broadcast ID to be random generated on each start", cmd_random_id),
	SHELL_COND_CMD(CONFIG_SHELL, fixed, NULL, "Set the broadcast ID to be a fixed value",
		       cmd_fixed_id),
	SHELL_SUBCMD_SET_END);

SHELL_STATIC_SUBCMD_SET_CREATE(
	configuration_cmd, SHELL_COND_CMD(CONFIG_SHELL, list, NULL, "List presets", cmd_list),
	SHELL_COND_CMD(CONFIG_SHELL, start, NULL, "Start broadcaster", cmd_start),
	SHELL_COND_CMD(CONFIG_SHELL, stop, NULL, "Stop broadcaster", cmd_stop),
	SHELL_COND_CMD(CONFIG_SHELL, show, NULL, "Show current configuration", cmd_show),
	SHELL_COND_CMD(CONFIG_SHELL, packing, NULL, "Set type of packing", cmd_packing),
	SHELL_COND_CMD(CONFIG_SHELL, preset, NULL, "Set preset", cmd_preset),
	SHELL_COND_CMD(CONFIG_SHELL, lang, NULL, "Set language", cmd_lang),
	SHELL_COND_CMD(CONFIG_SHELL, immediate, NULL, "Set immediate rendering flag",
		       cmd_immediate_set),
	SHELL_COND_CMD(CONFIG_SHELL, num_subgroups, NULL, "Set number of subgroups",
		       cmd_num_subgroups),
	SHELL_COND_CMD(CONFIG_SHELL, num_bises, NULL, "Set number of BISes", cmd_num_bises),
	SHELL_COND_CMD(CONFIG_SHELL, context, NULL, "Set context", cmd_context),
	SHELL_COND_CMD(CONFIG_SHELL, location, NULL, "Set location", cmd_location),
	SHELL_COND_CMD(CONFIG_SHELL, broadcast_name, NULL, "Set broadcast name",
		       cmd_broadcast_name),
	SHELL_COND_CMD(CONFIG_SHELL, encrypt, NULL, "Set broadcast code", cmd_encrypt),
	SHELL_COND_CMD(CONFIG_SHELL, usecase, NULL, "Set use case", cmd_usecase),
	SHELL_COND_CMD(CONFIG_SHELL, clear, NULL, "Clear configuration", cmd_clear),
	SHELL_COND_CMD(CONFIG_SHELL, adv_name, NULL, "Set advertising name", cmd_adv_name),
	SHELL_COND_CMD(CONFIG_SHELL, program_info, NULL, "Set program info", cmd_program_info),
	SHELL_COND_CMD(CONFIG_SHELL, phy, NULL, "Set PHY", cmd_phy),
	SHELL_COND_CMD(CONFIG_SHELL, framing, NULL, "Set framing", cmd_framing),
	SHELL_COND_CMD(CONFIG_SHELL, rtn, NULL, "Set number of re-transmits", cmd_rtn),
	SHELL_COND_CMD(CONFIG_SHELL, sdu, NULL, "Set SDU (octets)", cmd_sdu),
	SHELL_COND_CMD(CONFIG_SHELL, mtl, NULL, "Set Max Transport latency (ms)", cmd_mtl),
	SHELL_COND_CMD(CONFIG_SHELL, frame_interval, NULL, "Set frame interval (us)",
		       cmd_frame_interval),
	SHELL_COND_CMD(CONFIG_SHELL, pd, NULL, "Set presentation delay (us)", cmd_pd),
	SHELL_COND_CMD(CONFIG_SHELL, file, &sub_file_cmd, "File commands", NULL),
	SHELL_COND_CMD(CONFIG_SHELL, broadcast_id, &sub_broadcast_id_cmd, "Broadcast ID commands",
		       NULL),
	SHELL_SUBCMD_SET_END);

SHELL_CMD_REGISTER(nac, &configuration_cmd, "nRF Auraconfig", NULL);
